export default {
    all: 'Барлығы',
    yes: 'Иә',
    no: 'Жоқ',
    you: 'Бұл сіз',
    start: 'Бастау',
    finish: 'Аяқтау',
    create: 'Кұру',
    created: 'Кұрылған',
    add: 'Қосу',
    added: 'Қосылды',
    not_added: 'Қосылмаған',
    user_added: 'Қосылды',
    user_not_added: 'Қосылмаған',
    delete: 'Жойып тастау',
    instructions: 'Нұсқаулықтар',
    note: 'Ескерту',
    result: 'Нәтиже',
    results: 'Нәтижелер',
    verified: 'Тексерілді',
    not_verified: 'Тексерілмеген',
    passed: 'Орындалды',
    choose: "Таңдау",
    choose_an_option: "Нұсқаны таңдаңыз",
    choose_your_option: "Өз нұсқаңызды таңдаңыз",
    download: "Жүктеп алу",
    loading: "Жүктелуде",
    export_to_png: "PNG экпорттау",
    export_to_xlsx: "XLSX экспорттау",
    export_to_pdf: "PDF экпорттау",
    print_pdf: "PDF басып шығару",
    click_to_listen_to_the_audio: "Аудионы тыңдау үшін басыңыз",
    all_rights: 'Барлық құқықтар сақталған.',
    choose_your_language: 'Тілді таңдаңыз',
    choose_a_mentor: 'Тәлімгерді таңдаңыз',
    choose_a_category: 'Санатты таңдаңыз',
    continue: 'Жалғастыру',
    merge: "Біріктіру",
    move_up: "Жоғары жылжыту",
    move_down: "Төмен жылжыту",
    move_left: "Солға жылжыту",
    move_right: "Оңға жылжыту",
    split: "Бөліп тастау",
    save: 'Сақтау',
    saving: 'Сақтау',
    generate: "Генерациялау",
    restart: 'Қайта жүктеу',
    edit: "Қайта өңдеу",
    welcome: 'Қош келдіңіз!',
    you_are_on_the_main_page: 'Біз сізді сайтымыздың басты бетінде көргенімізге қуаныштымыз.',
    online: 'Желіде',
    offline: 'Желіде емес',
    or: 'Немесе',
    back: 'Артқа',
    close: 'Жабу',
    check: 'Тексеру',
    swap_places: 'Орындарымен ауыстыру',
    an_error_occurred: 'Қателік орнады',
    nothing_was_found_for_your_query: "Сіздің сұранымыңыз бойынша ештеңе табылған жоқ",
    time_is_up: "Уақыт бітті!",
    remaining_time: "Қалған уақыт",
    already_started: "Басталып кетті",
    write_here_and_press_add: "Осы жерге енгізіңіз кейін 'Қосу' батырмасын басыңыз",

    sort_by_this_column: 'Осы баған бойынша сұрыптау',
    sort_asc: 'Өсу бойынша сұрыптау',
    sort_desc: 'Кему бойынша сұрыптау',

    status: "Мәртебе",
    choose_a_status: "Мәртебені таңдаңыз",
    invite: "Шақыру",
    search: "Іздеу",
    accept: "Қабылдау",

    operator: "Оператор",
    iniciator: "Бастамашы",
    executor: "Орындаушы",
    mentor: "Тәлімгер",
    learner: "Оқушы",
    applicant: "Өтініш беруші",
    recipient: "Алушы",
    selected: "Таңдалды",
    not_selected: "Таңдалмаған",
    not_specified: "Көрсетілмеген",
    changed: "Өзгерген",
    your_answer: "Сіздің жауабыңыз",
    learner_answer: "Оқушының жауабы",
    type_your_answer: "Жауабыңызды осында енгізіңіз",
    type_your_message: "Хабарлама жазыңыз",
    no_answer: "Жауап жоқ",
    title: "Тақырып",
    text_center: "Мәтін ортада",
    right: "Дұрыс!",
    wrong: "Дұрыс емес!",
    right_answer: "Дұрыс жауабы",
    right_answers: "Дұрыс жауаптар",
    right_answers_count: "Дұрыс жауаптар саны",
    wrong_answer: "Дұрыс емес жауап",
    wrong_answers: "Қате жауаптар",
    wrong_answers_count: "Қате жауаптар саны",
    unverified_answer: "Тексерілмеген жауап",
    unverified_answers: "Тексерілмеген жауаптар",
    unverified_answers_count: "Тексерілмеген жауаптар саны",
    answer_options: "Жауап нұсқалары",
    message: "Хабарлама",
    write_a_comment: "Пікір жазыңыз",
    comment: "Пікір",
    comments: "Пікірлер",
    active: "Белсенді",
    content: "Мазмұны",
    for_re_examination: "Қайта оқуға арналған",
    get_ready: "Дайын болыңыз",
    thinking: "Ойланып жатырмын",
    recording: "Жазылып жатыр",
    handling: "Өңделіп жатыр",
    number_of_options: "Нұсқалар саны",
    number_of_attempts: "Қателерді түзету әрекеттерінің саны",
    random_order: "Кездейсоқ тәртіпте шығару",
    random_order_words: "Сөздерді кездейсоқ тәртіпте шығару",
    random_order_pictures: "Суреттерді кездейсоқ тәртіпте шығару",

    created_at: "Шыққан уақыты",
    created_at_from: "Шыққан уақыты (бастап)",
    created_at_to: "Шыққан уақыты (дейін)",
    registered_at: "Тіркелген уақыты",
    registered_at_from: "Тіркелген уақыты (бастап)",
    registered_at_to: "Тіркелген уақыты (дейін)",
    completed_at: "Орындалған уақыты",
    completed_at_from: "Орындалған уақыты (бастап)",
    completed_at_to: "Орындалған уақыты (дейін)",

    reset_search_filter: "Cүзгіні қалпына келтіру",
    show_search_filter: 'Іздеу сүзгісін көрсету',
    hide_search_filter: 'Іздеу сүзгісін жасыру',

    years: 'Жылдар',
    year: 'Жыл',
    month: 'Ай',
    week: 'Апта',
    day: 'Күн',

    start_time: 'Басталу уақыты',
    end_time: 'Аяқталу уақыты',
    no_events: 'Іс-шара жоқ',
    yet_another: 'Тағы',

    documents: 'Құжаттар',
    check_your_data: 'Деректемелеріңізді тексеріп алыңыз',
    contacts: 'Байланыс',
    description: 'Сипаттамасы',

    total: 'Барлығы',
    step: 'Қадам',
    theme: {
        switch_to_a_light_theme: "Жарық тақырыпқа ауысу",
        switch_to_a_dark_theme: "Қараңғы тақырыпқа ауысу"
    },

    save_changes: {
        title: "Өзгерістерді сақтау",
        confirm: "Сіз өзгерістерді сақтағыңыз келеді ме?",
        save: "Сақтау",
        unsave: "Сақтамау",
        return: "Оралу"
    },

    file: {
        file: "Файл",
        files: "Файлдар",
        name: "Файлдың атауы",
        size: "Файлдың өлшемі",
        type: "Файлдың түрі",
        disk_info: "Диск кеңістігі туралы дерек",
        show_disk_info: "Диск кеңістігін көрсету",
        hide_disk_info: "Диск кеңістігін жасыру",
        search_filter: "Файлды іздеу сүзгісі",
        choose_a_file: "Файлды таңдаңыз",
        choose_a_file_type: "Файлдың түрін таңдаңыз",
        specify_the_file_name: "Файлдың атын енгізіңіз",
        specify_the_file_type: "Файлдың түрін көрсетіңіз",
        selected_file: "Сіз таңдаған файл",
        change_file: "Басқа файл таңдау",
        file_ready_to_upload: "Файл жүктелуге дайын",
        upload: "Жүктеу",
        upload_file: "Файл жүктеу",
        uploading_a_new_file: "Жаңа файл жүктеу",
        uploading_file: "Файл жүктелініп жатыр",
        upload_from_media: "Бұрын жүктелгендердің ішінен таңдау",
        generate: "ЖИ арқылы генерациялау",
        deleting_a_file: "Файлды жою",
        file_delete_confirm: "Сіз расыменде бұл файлды жойғыңыз келе ме? Осы файлға байланысты барлық нәрсе де сонымен бірге жойылады.",
        kilobyte: "КБ",
        megabyte: "МБ",
        gigabyte: "ГБ",
        total_space: "Жалпы орын",
        free_space: "Бос орын",
        used_space: "Толған орын",
        increase_the_space: "Орынды ұлғайту",
        lack_of_disk_space: "Мына файлды жүктеу үшін дискідегі орын жеткіліксіз. Дискідегі орынды ұлғайту үшін сізге жоғарғы тарифтік жоспарға көшу қажет.",
        choose: "Файлды таңдаңыз",
        replace: {
            title: "Файлды ауыстыру",
            replace: "Ауыстыру",
        },
        convert: "Түрлендіру",
        image: {
            select: "Суретті таңдаңыз",
            current: "Ағымдағы жүктеліп тұрған сурет"
        },
        audio: {
            select: "Аудиофайл таңдаңыз",
            current: "Ағымдағы жүктеліп тұрған аудио",
            voice: "Дауыс",
            choose_a_voice: "Дауысты таңдаңыз"
        },
        video: {
            select: "Бейнефайл таңдаңыз",
            current: "Ағымдағы жүктеліп тұрған бейне",
            player: {
                play: "Ойнату",
                pause: "Тоқтат тұру",
                mute: "Дыбыссыз",
                unmute: "Дыбыспен",
                settings: "Баптаулар",
                speed: "Жылдамдық",
                normal: "Қалыпты",
                quality: "Сапасы",
                fullscreen: "Бүкіл экранға",
                exitFullscreen: "Бүкіл экраннан шығу",
                processing: "Бейнефайл өңделіп жатыр. Сіз әзірше бейнефайлдың түпнұсқасын қарап отырсыз"
            },
            markers: {
                title: 'Маркерлер',
                add: 'Маркер қосу',
                name: 'Маркер атауы',
                name_error: 'Маркер атауын енгізіңіз',
                second: 'Секунд',
                second_error: 'Секундты енгізіңіз'
            }
        }
    },

    materials: {
        title: "Материалдар",
        material: "Материал",
        add_material: "Материал қосу",
        edit_material: "Материалды өңдеу",
        delete_material: "Материалды жою",
        delete_confirm: "Сіз бұл материалды шынымен жойғыңыз келе ме?",
        materials_count: "Материалдар саны",
        sentence_materials: "Сөйлемдердің материалдары",
        annotation: 'Қысқаша сипаттамасы (аннотация)',
        display: 'Оқушыларға көрсету',
        display_title: 'Материалды оқушыларға көрсету',
        displayed: 'Оқушылар көріп жатыр',
        displayed_title: 'Материалды оқушылар көріп жатыр',
        learn: {
            video: "Тапсырманың материалымен танысу үшін осы бейнежазбаны мұқият қарап алыңыз",
            audio: "Тапсырманың материалымен танысу үшін осы аудиожазбаны мұқият тыңдап алыңыз",
            image: "Тапсырманың материалымен танысу үшін осы суретті мұқият қарап алыңыз",
            text: "Тапсырманың материалымен танысу үшін осы мәтінді мұқият оқып алыңыз",
            table: "Тапсырманың материалымен танысу үшін осы кестені мұқият қарап алыңыз",
        },
        show_materials_option: {
            use_both_options: "Екі нұсқаны қолдану",
            show_materials_during_a_task: "Материалдарды тапсырма өтіп жатқан кезде көрсету",
            show_materials_before_starting_a_task: "Материалдарды тапсырманы бастамас бұрын көрсету"
        },
        chat: {
            welcome: {
                title: "Cәлеметсіз бе {name}! 👋 Сізге қалай көмектесе аламын?",
                text_1: "👨‍🏫 Мен сіздің виртуалды мұғаліміңіз және оқытудағы көмекшіңіз боламын. Менің міндетім - сіз оқып жатқан материалды түсінікті және сабырлы түрде түсіндіру, қиын тақырыптарды түсінуге көмектесу және сұрақтарға біртіндеп жауап беру.",
                text_2: "Егер бірдеңе қиын болып көрінсе-айтыңыз, Мен басқаша түсіндіремін. Бірге үйренейік!😊"
            },
            prompts: {
                explain: "Материалды түсіндір",
                example: "Мысал келтір"
            }
        }
    },

    text: {
        welcome: "Сіз осында өз мәтініңізді енгізе аласыз",
        bold: "Толық",
        italic: "Курсивті",
        underline: "Асты сызылған",
        strikethrough: "Үсті сызылған",
        title: "Тақырып",
        li: "Маркерлі тізім",
        ol: "Нөмірленген тізім",
        text_left: "Солға қарай түзеу",
        text_center: "Ортаға қарай түзеу",
        text_right: "Оңға қарай түзеу"
    },

    table: {
        create: "Кесте қосу",
        copy_and_paste_the_table_here: "Кестені осында көшіріп қойыңыз",
        rows_count: "Жолдар саны",
        add_row: "Жол қосу",
        delete_rows: "Жолдарды жою",
        columns_count: "Бағандар саны",
        add_column: "Баған қосу",
        delete_columns: "Бағандарды жою",
        delete_table: "Кестені жою",
        table_options: "Кестенің баптаулары",
        has_header: "Тақырыптары бар кесте",
        is_small: "Кішкентай кесте",
        is_striped: "Жолақты кесте",
        is_bordered: "Шекарасы бар кесте",
        error_1: "Жолдар мен бағандар саны 1-ден жоғары болуы керек",
        error_2: "Барлық жолдарды жоюға болмайды",
        error_3: "Барлық бағандарды жоюға болмайды",
        error_4: "Алдымен сізге кесте қосу қажет",
        confirm_1: "Сіз кестені жойғыңыз келетініне сенімдісіз бе?"
    },

    pagination: {
        first_page_title: "Бірінші бетке өту",
        previous_page_title: "Алдыңғы бетке өту",
        next_page_title: "Келесі бетке өту",
        last_page_title: "Соңғы бетке өту",
        limit_per_page: "Әр беттің шегі",
        unlimit: "Шектеу жоқ",
        shown: "Көрсетілді: {shown} / {total}"
    },

    errors: {
        error_code: 'Қатенің коды',
        page_is_not_available: "Бұл бет осы рөлге қол жетімді емес",
        show_error: "Қатені көрсету",
        hide_error: "Қатені жасыру",
        media: {
            camera_error: 'Камера мен микрофон қолжетімсіз.',
            screen_sharing_error: 'Демонстрация бұл құрылғыда қолжетімсіз.'
        },
        server: {
            error: 'Сервермен байланыс орнатылмады. Интернет байланысын тексеруіңізді өтінеміз.',
            room_error: 'Конференцияға кіру мүмкін емес. Бетті қайта жүктеп көріңіз.',
            peer_error: 'P2P байланыс орнатылмады.  Интернет байланысын тексеруіңізді өтінеміз.'
        },
        statuses: {
            status_undefined: "Белгісіз қате орын алды!",
            status_400: "Серверде белгісіз қате орын алды!",
            status_401: "Сіз жеке кабинетіңізге кіруіңіз керек!",
            status_403: "Бұл бетке кіруге тыйым салынады!",
            status_404: "Бет табылмады!",
            status_500: "Сервер жағынан қателік орын алды!"
        }
    },

    form: {
        email: 'Эл.пошта',
        school_email: 'Мектептің эл.поштасы',
        first_name: 'Аты',
        last_name: 'Тегі',
        phone: 'Телефон',
        password: 'Құпиясөз',
        new_password: 'Жаңа құпиясөз',
        password_confirmation: 'Құпиясөзді растау',
        new_password_confirmation: 'Жаңа құпиясөзді растау',
        school_data: 'Мектептің деректері',
        school_owner_data: 'Мектептің иесінің деректері',
        school_name: 'Мектептің аты',
        full_school_name: 'Мектептің толық атауы (ЖК/ЖШС)',
        school_domain: 'Мектептің домендік атауы',
        reset_school: 'Мектепті ауыстыру',
        select_a_school: 'Мектепті таңдаңыз',
        schools_not_found: 'Аталған елді мекенде мектептер жоқ',
        country: 'Ел',
        region: 'Өңір',
        city: 'Қала',
        street: 'Көше, ш-аудан',
        house: 'Үй, құрылыс №',
        flat: 'Пәтер',
        bin: 'БСН/ЖСН',
        iik: 'ЖСK',
        bik: 'БСК',
        knp: 'ТТК',
        fact_address: 'Нақты мекен-жайы',
        select_a_point: 'Елді мекенді таңдаңыз',
        select_an_internal_point: 'Ішкі елді мекенді таңдаңыз',

        card: {
            input_bank_data: 'Банк картаңыздың деректерін енгізіңіз',
            card_num: 'Картаның нөмірі',
            expiration_at: 'Картаның жарамды мерзімі',
            month: 'Ай',
            year: 'Жыл',
            cvv: 'Картаның артындағы 3 сан',
            name: 'Картаның иесі',

            tiptop: {
                errors: {
                    'CardNumber_Empty': 'Картаның нөмірін енгізіңіз',
                    'CardNumber_Invalid': 'Картаның нөмірі қате енгізілген',
                    'Cvv_Empty': 'CVV енгізіңіз',
                    'Cvv_Invalid': 'CVV қате енгізілген',
                    'ExpDateMonthYear_Empty': 'Ай және жылды енгізіңіз',
                    'ExpDateMonthYear_Invalid': 'Ай және жыл қате енгізілген',
                    'ExpDateMonth_Empty': 'Айды енгізіңіз',
                    'ExpDateMonth_Invalid': 'Ай қате енгізілген',
                    'ExpDateYear_Empty': 'Жылды енгізіңіз',
                    'ExpDateYear_Invalid': 'Жыл қате енгізілген',
                    'Name_Empty': 'Аты-жөніңізді енгізіңіз *',
                    'Name_Invalid': 'Аты-жөніңіз қате енгізілген *',
                    'Name_TooLong': 'Аты-жөніңіз ұзын енгізілген *',
                    'Name_TooShort': 'Аты-жөніңіз қысқа енгізілген *',
                }
            }
        }
    },

    telegram: {
        connect: {
            title: 'Telegram ботқа қосылу',
            connect: 'Қосылу',
        },
        disconnect: {
            title: 'Telegram ботты өшіру',
            disconnect: 'Өшіру',
            confirm: 'Сіздің аккаунт {auth_user_name} {tg_user_name} Telegram аккаунтынан ажыратылады. Ботты өшірген жағдайда сіз сабақтар мен маңызды жаңартулар туралы хабарлама алуды тоқтатасыз. Қажет болса, ботты кез келген уақытта қайта қосуға болады. Келісесіз бе? Жалғастыру үшін "Өшіру" батырмасын басыңыз.'
        },
        banner: {
            title: 'EasySpeak Telegram-ботына қосылыңыз',
            description: 'Тікелей Telegram арқылы кесте бойынша жоспарланған сабақтар туралы хабарламалар, сабақ кестесі және оқу үлегрімін көріп отыра аласыз.'
        },
        cancel: 'Бас тарту',
        message_1: 'Сіздің аккаунт {auth_user_name} {tg_user_name} Telegram аккаунтына қосылады. Жалғастыру үшін "Қосу" батырмасын басыңыз.',
        message_2: 'Сіздің аккаунт {auth_user_name} {old_tg_user_name} Telegram аккаунтына қосулы тұр. {new_tg_user_name} Telegram аккаунтына қосылу үшін "Қосу" батырмасын басыңыз.'
    },

    board: {
        show_tool_parameters: 'Құралдың сипаттамасын көрсету',
        tool_parameters: 'Құралдың сипаттамасы',
        font_size: 'Қаріптің өлшемі',
        tools: {
            move: 'Қозғау',
            pencil: 'Қарындаш',
            brush: 'Қылқалам',
            line: 'Сызық',
            rectangle: 'Төртбұрыш',
            circle: 'Шеңбер',
            text: 'Мәтін',
            eraser: 'Өшіргіш'
        },
        params: {
            text_color: 'Мәтін түсі',
            border_color: 'Жақтау түсі',
            fill_color: 'Ішкі түсі',
            cell_color: 'Ұяшық түсі',
            border_width: 'Қалыңдығы',
            text_params: 'Мәтіннің баптаулары'
        },
        actions: {
            redo: 'Қайтару',
            undo: 'Бас тарту',
            clear: 'Тазарту',
            save: 'Сақтау'
        }
    },

    weekdays: {
        monday: {
            title: 'Дүйсенбі',
            even: 'Әр дүйсенбі сайын'
        },
        tuesday: {
            title: 'Сейсенбі',
            even: 'Әр сейсенбі сайын'
        },
        wednesday: {
            title: 'Сәрсенбі',
            even: 'Әр сәрсенбі сайын'
        },
        thursday: {
            title: 'Бейсенбі',
            even: 'Әр бейсенбі сайын'
        },
        friday: {
            title: 'Жұма',
            even: 'Әр жұма сайын'
        },
        saturday: {
            title: 'Сенбі',
            even: 'Әр сенбі сайын'
        },
        sunday: {
            title: 'Жексенбі',
            even: 'Әр жексенбі сайын'
        },
    },

    pages: {
        error: {
            title: 'Қателік орын алды'
        },

        home: {
            title: 'Басты бет',
            'header-title': 'Ағылшын тілін үйренуге арналған цифрлық білім беру платформасы',
            hello: 'Қош келдіңіз!',
            to: "Басты бетке",
            description: 'Ағылшын тілін үйренуге арналған цифрлық білім беру платформасы',

            hero: {
                title: 'Ағылшын тілін үйрену платформасы',
                description: 'Оқушыларды біздің әдістеме бойынша оқытыңыз. Онлайн мектептер үшін дайын шешім.'
            },

            demo: {
                request_button: 'Демонстрацияға сұраным қалдыру'
            },

            demo_modal: {
                title: 'Демонстрацияға сұраным қалдыру',
                description: 'Байланыс деректеріңізді қалдырыңыз. Жақын арада біздің менеджер платформаны көрсету үшін сізбен байланысады.',
                consent: {
                    text: "Менің жеке деректерімді",
                    link: "құпиялылық саясатымен ",
                    text_2: "сәйкес өңдеуге келісімімді беремін."
                },
                sended: '✅ Платформамызға қызығушылық танытқаныңыз үшін рахмет! Біздің менеджер жақын арада сізбен байланысқа шығады.'
            },

            section_2: {
                card_1: {
                    title: 'Оқушыларға',
                    item_1: 'Тілдік курстары, тапсырмалары және ілгерілеуі бар жеке кабинет',
                    item_2: 'Кез — келген құрылғыдан-компьютерден, планшеттен, телефоннан қол жеткізу',
                    item_3: 'Оқытушылармен және техникалық қолдаумен сөйлесу',
                    item_4: 'Мотивация: ұпайлар, жетістіктер, сертификаттар',
                    item_5: 'Сабақтарды жазу және тікелей эфир'
                },
                card_2: {
                    title: 'Мектептер мен білім беру орталықтары үшін',
                    item_1: 'Курстар, сабақтар, тесттер, бейнелер — барлығы бақылауда',
                    item_2: 'Сабақ кестесі, ескертулер және оқушыларды бақылау',
                    item_3: 'Оқытушыларды қосу және рөлдерді реттеу',
                    item_4: 'Статистика, есептер, төлем — барлығы бір жерде',
                }
            },

            section_3: {
                title: 'Платформа кімге сәйкес келеді?',
                card_1: {
                    title: 'Мектептерге',
                    description: 'Оқушылар мен оқытушылардың жеке кабинеттері бар брендтелген онлайн-платформа'
                },
                card_2: {
                    title: 'Оқытушыларға',
                    description: 'Сабақтарды өткізуге, үлгерімді бақылауға және материалдарды жүктеуге арналған құралдар'
                },
                card_3: {
                    title: 'Оқушыларға',
                    description: 'Оқуға, сабақ кестесіне, үй тапсырмасына және прогреске ыңғайлы қол жетімділік'
                },
            },

            section_4: {
                title: 'Біздің сайттан кейбір скриншоттар',
                description: 'Өтінім қалдырыңыз, біз қалай оңай бастау керектігін көрсетеміз'
            },

            section_5: {
                title: 'Платформаңызды іске қосуға дайынсыз ба?',
                description: 'Өтінім қалдырыңыз, біз қалай оңай бастау керектігін көрсетеміз'
            }
        },

        "privacy-policy": {
            title: 'Құпиялылық саясаты'
        },

        "refund-policy": {
            title: 'Қаражатты қайтару саясаты'
        },

        "the-offer-agreement": {
            title: 'Ашық ұсыныс шарты'
        },

        profile: {
            title: 'Менің парақшам',
        },

        auth: {
            title: 'Авторизация'
        },

        login: {
            title: 'Жүйеге кіру',
            sign_in: 'Кіру',
            dont_have_an_account: "Менде аккаунт жоқ.",
            forgot_password: "Құпиясөзді ұмыттыңыз ба?",
            password_recovery: "Қалпына келтіру",
            sign_out: 'Аккаунттан шығу',
        },

        logout: {
            title: 'Аккаунттан шығу',
            please_wait: 'Күте тұрыңыз, аккаунттан шығып жатырмыз'
        },

        register: {
            title: 'Тіркелу',
            have_an_account: 'Менде акканут бар.',
        },

        "password-recovery": {
            title: 'Құпиясөзді қалпына келтіру',
            invalid: 'Құпиясөзді қалпына келтіру сілтемесі жарамсыз. Құпиясөзді қайта қалпына келтіріп көріңіз.',
            send: 'Біз сіз көрсеткен электрондық поштаға құпиясөзді қалпына келтіру сілтемесін жібердік. Пошта жәшігін, соның ішінде Спам қалтасын тексеріңіз.'
        },


        "change-password": {
            title: 'Құпиясөзді өзгерту',
            inst_1: 'Сәлеметсіз бе, {name}! Жаңа құпиясөз ойлап тауып, оны растауыңызды сұраймыз. Құпиясөз кемінде 8 таңбадан тұратын, күрделі болуы тиіс. Осыдан кейін сіз өз аккаунтыңызға қайта кіре аласыз.',
        },

        dashboard: {
            title: 'Жеке кабинет',
            go_to_dashboard: 'Жеке кабинетке өту'
        },

        "users-groups": {
            title: 'Қолданушылар мен топтар'
        },

        users: {
            title: "Қолданушылар",
            invite_user_title: "Жаңа қолданушыны шақыру",
            edit_user_title: "Қолданушының деректерін қайта өңдеу",
            user_mode: 'Менің ағымдағы рөлім',
            user_info: "Қолданушы туралы деректер",
            user_status: "Қолданушының мәртебесі",
            user_role: "Қолданушының рөлі",
            users_count: "Белсенді оқушылар саны",
            select_user_roles: "Жаңа қолданушыға рөл-(дер) таңдаңыз",
            search_filter: "Қолданушыларды іздеу сүзгісі",
        },

        groups: {
            title: 'Топтар',
            group: 'Топ',
            choose: 'Топты таңдаңыз',
            create_group: "Топ құру",
            saving_a_group: "Топты сақтау",
            create_group_title: "Жаңа топ құру",
            edit_group_title: "Топты қайта өңдеу",
            group_name: "Топтың атауы",
            group_category: "Топтың санаты",
            group_description: "Топтың сипаттамасы",
            search_filter: "Топты іздеу сүзгісі",
            add_members_to_group: "Топқа қатысушыларды қосу",
            edit_group_members: "Қатысушыларды өңдеу",
            members: "Топ мүшелері",
            members_count: "Қатысушылар саны",
            added_members_count: "Қосылған қатысушылар саны",
            note_1: "Қатысушыларды топқа қосу үшін төмендегі кестеде оларды басыңыз",
            warning_1: "Бұл қатысушы топқа қосулы тұр",
            not_member: "Топқа қатысы жоқ",
            belongs_to_another_group: "Басқа топқа қатысты",
            already_members_of_a_similar_group: "Төмендегі оқушылар сіз таңдаған деңгейдегі ұқсас топта бар. Осы топқа қосу үшін оларды төмендегі топтан алып тастаңыз."
        },

        school: {
            title: 'Мектеп'
        },


        subscription: {
            plan: 'Тарифтік жоспар',
            your_plan: 'Сіздің тарифтік жоспар',
            expired: 'Платформада жұмысты жалғастыру үшін сізге тарифтік жоспардың мерзімін ұзарту қажет',
            expired_at: 'Тарифтің біту уақыты',
            prolongation_title: 'Тарифтік жоспарды ұзарту',
            prolongation: 'Ұзарту',
            choose_a_plan: 'Тарифтік жоспарды таңдаңыз'
        },

        payment: {
            title: 'Төлемдерді көру',
            choose_a_payment_method: 'Төлем түрін таңдау',
            choose_a_payment_form: 'Төлем қабылдау түрін таңдаңыз',
            payment_method: 'Төлем түрі',
            payment_form: 'Төлем қабылдау түрі',
            accept_payment: 'Төлемді растау',
            please_wait: 'Күте тұрыңыз, төлем қабылданып жатыр',
            to_pay: 'Төлеу',
            to: 'Жалпы төлеуге',

            forms: {
                natural_person: 'Жеке тұлғаның өз атынан (оқушыдан)',
                legal_entity: 'Заңды тұлғаның атынан',
                message_1: 'Назар аударыңыз! Сіз тек заңды тұлғаның атынан тіркелген топтардың төлемдерін өңдей аласыз.'
            },

            methods: {
                invoice: {
                    title: 'Төлем шоты',
                    invoices: 'Төлем шоттары',
                    desc_1: 'Банк арқылы берілген шотты төлеу. Сіз шотты PDF форматында жүктеп алуыңыз керек.',
                    desc_2: 'Егер сіз шотты жеке тұлға ретінде төлейтін болсаңыз, онда сіз оны басып шығарып, өзіңізге ыңғайлы кез-келген банктің кез-келген филиалының кассасында төлеуіңіз керек.',
                    desc_3: 'Егер сіз шотты заңды тұлға ретінде төлесеңіз, бұл шотты электронды немесе басып шығарылған түрде бухгалтеріңізге беріңіз — ол онымен не істеу керектігін біледі.',
                    document: {
                        title: 'Төлем тапсырмасы',
                        num: 'Құжат №',
                        created_at: 'Жасалған күні',
                        payment_term: 'Төлеу мерзімі',
                        beneficiary: 'Бенефициар (қабылдаушы тарап)',
                        beneficiary_bank: 'Бенефициардың банкі (қабылдаушы тарап)',
                        please_be_careful: 'Өтініш, мұқият болыңыз!',
                        careful_desc: 'Шот шотта көрсетілген төлеушінің атынан төленуі керек. Шотты үшінші тұлғалардың төлеуіне жол берілмейді.Егер төлемді үшінші тұлғалар жүргізсе, ақша қаражаты жеке шоттың балансына аударылмайды, демек, қызметтер автоматты режимде іске қосылмайды.',
                        supplier: 'Жеткізуші',
                        executor: 'Орындаушы',
                        buyer: 'Сатып алушы',
                        customer: 'Тапсырыс беруші',
                        footing: 'Негіз',
                        without_contract: 'Келісім-шартсыз',
                        item: 'Атауы',
                        total_items: 'Барлық атаулар',
                        item_num: 'Саны',
                        unit: 'Бірлік',
                        price: 'Бағасы',
                        summ: 'Сомасы',
                        summ_alt: 'сомасы',
                        piece: 'дана',
                        total: 'Барлығы',

                        vat: 'ҚҚС',
                        vat_text: 'Оның ішінде ҚҚС ({vat}%)',
                        download_pdf: 'Шотты PDF форматында жүктеп алу'
                    },
                    accept: {
                        title: 'Төлемді қабылдау',
                        confirm: 'Сіз расымен де осы төлемді қабылдағыңыз келеді ме?'
                    }
                },
                card: {
                    title: 'Банк картасы'
                }
            }
        },

        'payment-result': {
            title: 'Төлем нәтижесі',
            success: 'Төлем сәтті өтті',
            success_alt: 'Төленді',
            fail: 'Төлем өтпей қалды',
            fail_alt: 'Төлем өткен жоқ',
            fail_alt_2: 'Төленген жоқ',
        },

        '3ds': {
            title: '3-D Secure аутентификация',
            please_wait: 'Күте тұрыңыз, 3-D Secure аутентификациясы жүріп жатыр'
        },

        invoices: {
            title: 'Төлем шоттары',
            search_filter: 'Шоттарды іздеу сүзбесі',
            num: 'Шот №'
        },

        schedule: {
            title: 'Сабақ кестесі',
            show_schedule: 'Сабақ кестесін көру',
            show_entire_schedule: 'Толық кестені көру',
            search_filter: 'Кесте бойынша іздеу сүзгісі',
            lesson_days: 'Сабақ өтетін күндер',
            select_lesson_days: 'Сабақ өтетін күндерді таңдаңыз',
            start_date_from: 'Сабақ кестесінің басталу уақыты (бастап)',
            start_date_to: 'Сабақ кестесінің басталу уақыты (дейін)',
            start_date: 'Сабақ кестесінің басталу күні',
            end_date: 'Сабақ кестесінің аяқталу күні',
            start_time: 'Сабақтың басталу уақыты',
            end_time: 'Сабақтың аяқталу уақыты',
        },

        events: {
            title: 'Іс-шаралар',
            no_events: 'Бұл күнге ешқандай іс-шара жоспарланған жоқ'
        },

        conference: {
            title: 'Бейнеконференция',
            create: 'Конференция қосу',
            create_conference: 'Конференция қосу',
            delete_conference: 'Конференцияны жою',
            delete_confirm: 'Сіз бұл конференцияны расымен жойғыңыз келе ме?',
            mic: 'Микрофон',
            mic_turn_on: 'Микрофонды іске қосу',
            mic_turned_on: 'Микрофон қосулы',
            mic_turn_off: 'Микрофонды өшіру',
            mic_turned_off: 'Микрофон өшірулі',
            video: 'Бейне',
            video_turn_on: 'Бейнені іске қосу',
            video_turn_off: 'Бейнені өшіру',
            demo: 'Демо',
            demo_turn_on: 'Демонстрацияны іске қосу',
            demo_turn_off: 'Демонстрацияны өшіру',
            board: 'Тақта',
            participants: 'Қатысушылар',
            participants_count: 'Қатысушылар саны',
            chat: 'Хабарлар',
            search_conference: 'Конференцияны іздеу',
            join: 'Конференцияға қосылу',
            until_the_start_of_the_conference: 'Конференция басталғанға дейін қалды:',
            no_current_conferences: 'Қазіргі уақытта ағымдағы конференциялар жоқ.',
            not_appointed: 'Сіз әлі мектептегі ешбір топқа тәлімгер ретінде тағайындалмаған секілдісіз. Бұл мәселені шешу үшін мектеп әкімшілігімен хабарласыңыз. Егер сіз әкімші болсаңыз, алдымен топ құруыңыз қажет.',
            assign_a_mentor_only_for_this_lesson: 'Тек осы сабаққа ғана тәлімгер етіп тағайындау',
            appoint_a_mentor_for_this_and_subsequent_lessons: 'Осы және келесі сабақтарға тәлімгер етіп тағайындау',
            appoint_a_mentor_for_this_and_subsequent_lessons_note: 'Таңдаған тәлімгеріңіз топтың осы және келесі сабақтарына тағайындалады.',
            you_cant_create_a_conference: 'Сіз жаңа конференция құра алмайсыз, себебі қазір басқа конференция өтіп жатыр. Оның аяқталуын күтіңіз немесе ағымдағы конференцияны жойыңыз.',
            mode: {
                grid: 'Кесте',
                slider: 'Карусель'
            },
            messages: {
                requesting_access: 'Камера мен микрофонға қолжетімділік сұралуда',
                no_paid: 'Конференцияға кіру шектеулі, өйткені бұл сабақ төленбеген.'
            },
            statuses: {
                current: 'Ағымдағы',
                planned: 'Жоспарланған',
                passed: 'Өтіп кеткен',
            },
            leave: {
                title: 'Конференциядан шығу',
                confirm: 'Сіз конференциядан шыққыңыз келетініне сенімдісіз бе?',
                yes: 'Ия, шығамын',
                no: 'Жоқ, қаламын'
            }
        },

        "operations-requests": {
            title: "Операциялар мен сұранымдар",
        },

        operations: {
            title: "Операциялар",
            operation_type: "Операцияның түрі",
            search_filter: "Операцияларды іздеу сүзгісі",
            description: "Операцияның сипаттамасы"
        },

        requests: {
            title: "Сұранымдар",
            request_type: "Cұранымның түрі",
            search_filter: "Сұранымдарды іздеу сүзгісі",
            description: "Сұранымның сипаттамасы"
        },

        notifications: {
            title: 'Хабарламалар',
            there_are_no_new_notifications: 'Жаңа хабарламалар жоқ'
        },

        courses: {
            title: 'Курстар',
            my_courses: 'Менің курстарым',
            course: 'Курс',
            go_to_courses: 'Курстарға өту',
            choose_a_course: 'Курсты таңдаңыз',
            course_level: 'Курстың санаты',
            choose_a_course_level: 'Курстың санатын таңдаңыз',
            level_overall_progress: 'Деңгей бойынша жалпы прогресс',
            section_overall_progress: 'Бөлім бойынша жалпы прогресс',
            course_section: 'Тарау',
            choose_a_course_section: 'Тарауды таңдаңыз',
            course_is_not_available: 'Курс қолжетімсіз. Курс қолжетімді болу үшін әкімшілікпен хабарласуыңызды өтінеміз.',
            course_is_not_available_for_learner: 'Курс қолжетімді болу үшін оқушыны топқа қосу керек.',
            not_sections: 'Курсқа секциялар қосылмаған.',
            modal: {
                description: 'Тілді меңгеру деңгейіңізді білу үшін қысқа тест тапсырыңыз! Жалғастыру үшін мектепті таңдап, біздің платформаға тіркеліңіз.',
                description_alt: 'Тілді меңгеру деңгейіңізді білу үшін қысқа тест тапсырыңыз.',
                sended: '✅ Курсымызға қызығушылық танытқаныңыз үшін рахмет! Біздің менеджер жақын арада сізбен байланысқа шығады.'
            }
        },

        lessons: {
            title: 'Сабақтар',
            lessons_count: 'Сабақтар саны',
            lessons_list: 'Сабақтар тізімі',
            there_is_no_lessons: 'Сабақ қосылмаған',
            there_is_no_lessons_alt: 'Мында сабақтар қосылмаған',
            pay_for_lessons: 'Сабақтарды төлеу',
            pay_for_lessons_alt: 'Сабақтарды төлеу',
            price: 'Бір сабақтың құны',
            price_alt: 'Сабақтың құны',
            price_edit: 'Сабақтың құнын тек мектеп иесі ғана өзгерте алады',
            lesson: 'Сабақ',
            lesson_name: 'Сабақтың атауы',
            free_lesson: 'Тегін сабақ',
            first_lesson_free: 'Бірінші сабақ тегін',
            bought_by_learner: 'Оқушы өзі сатып алды',
            current_lessons: 'Қазір өтіп жатырған сабақтар',
            no_current_lessons: 'Әзірше өтіп жатырған сабақтар жоқ',
            gone_lessons: 'Өтіп кеткен сабақтар',
            upcoming_lessons: 'Жақын арада өтетін сабақтар',
            upcoming_lessons_alt: 'Өтетін сабақтар',
            no_gone_lessons: 'Әзірше өтіп кеткен сабақтар жоқ',
            no_upcoming_lessons: 'Әзірше жақын арада өтетін сабақтар жоқ',
            lesson_description: 'Сабақтың қысқаша сипаттамасы',
            choosing_a_lesson: 'Сабақты таңдау',
            choose_a_lesson: 'Сабақты таңдаңыз',
            lesson_type: 'Сабақтың түрі',
            choose_a_lesson_type: 'Сабақтың түрін таңдаңыз',
            add_lesson: 'Сабақ қосу',
            add_unit: 'Бөлім қосу',
            add_unit_title: 'Бөлім қосу',
            unit_name: 'Бөлімнің атауы',
            lesson_materials: 'Материалдар',
            there_are_no_materials: 'Бұл сабаққа әзірше материалдар қосылмаған.',
            is_unavailable: 'Сабақ әзірше қолжетімсіз',
            is_unavailable_desc: 'Сабақ тәлімгермен конференция өткізілгеннен кейін қолжетімді болады.',
            start_date: 'Сабақтың өтетін күні',
            start_time: 'Сабақтың өтетін уақыты',
            date_shift_couple: 'Топтағы осы сабақтың өткізу күнін ең көп дегенде екі күнтізбелік күнге ауыстыру',
            date_shift_by_week: 'Таңдалған күнге қатысты топтың осы және келесі сабақтарының өткізу күнін ауыстыру',
            date_shift_by_week_note: 'Ағымдағы сабақтың жаңа күнін таңдаған кезде, жүйе осы топтағы барлық кейінгі сабақтардың күндерін олардың арасындағы бастапқы аралықты сақтай отырып автоматты түрде қайта есептейді. Мысалға егер сабақтар аптасына бір рет өткізілсе, онда әрбір келесі сабақтың күні жаңа таңдалған күннен бастап дәл 7 күнге жылжиды.',
        },

        "add-lesson": {
            title: 'Сабақ қосу'
        },

        "education-program": {
            title: 'Оқу бағдарламасы',
            grade: 'Оқушының үлгерімі',
            get_grade: 'Үлгерімді тексеру'
        },

        dictionary: {
            title: 'Сөздік',
            word: 'Cөз',
            count: 'Сөздер саны',
            options: 'Сөздіктің баптаулары',
            this_word_is_hidden: 'Мына сөз жасырулы',
            hide_this_word: 'Мына сөзді жасыру',
            this_word_is_extra: 'Мына сөз артық',
            make_this_word_extra: 'Мына сөзді артық ету',
            select_words: 'Сөздерді таңдау',
            studied_words: 'Зерттелген сөздер',
            unstudied_words: 'Қайта зерттеуге арналған сөздер',
            added_words_count: 'Қосылған сөздер саны',
            exactly_words_count_error: 'Тізімнен {count} сөз таңдауыңыз қажет',
            min_words_count_error: 'Тізімнен кем дегенде {count} сөз таңдауыңыз қажет',
            add: 'Сөздік қосу',
            add_section: 'Бөлім қосу',
            add_these_words_to_the_section: 'Осы сөздерді бөлімге қосу',
            words_left: "Қайталауға қалған сөздер саны",
            add_word_title: 'Сөздікке сөз қосу',
            edit_word_title: 'Сөзді қайта өңдеу',
            transcription: 'Транскрипциясы',
            seconds_per_word: 'Әр сөзге жауап беруге бөлінетін секунд саны',
            required: 'Сөзді енгізу қажет',
            category_slug: 'Санаттың негізгі тілдегі атауы',
            there_are_no_words: 'Бұл сабаққа әзірше ешқандай сөз сөздік қорынан қосылмаған',
            translate: {
                kk: 'Сөздің қазақша тілдегі аудармасы',
                ru: 'Сөздің орысша тілдегі аудармасы',
                category_kk: 'Санаттың қазақша тілдегі аудармасы',
                category_ru: 'Санаттың орысша тілдегі аудармасы',
            },
            search_filter: 'Сөздіктен іздеу сүзгісі'
        },

        sentences: {
            title: 'Сөйлемдер',
            sentence: 'Cөйлем',
            select_sentences: 'Сөйлемдерді таңдау',
            studied_sentences: 'Зерттелген сөйлемдер',
            unstudied_sentences: 'Қайта зерттеуге арналған сөйлемдер',
            added_sentences_count: 'Қосылған сөйлемдер саны',
            sentences_left: "Қайталауға қалған сөйлемдер саны",
            add_sentence_title: 'Сөйлем қосу',
            edit_sentence_title: 'Сөйлемді қайта өңдеу',
            transcription: 'Транскрипциясы',
            seconds_per_sentence: 'Әр сөйлемге жауап беруге бөлінетін секунд саны',
            required: 'Сөйлемді енгізу қажет',
            translate: {
                kk: 'Сөйлемнің қазақша тілдегі аудармасы',
                ru: 'Сөйлемнің орысша тілдегі аудармасы'
            },
            search_filter: 'Сөйлемді іздеу сүзгісі'
        },

        sections: {
            sections_count: 'Бөлімдер саны',
            added_sections_count: 'Қосылған бөлімдер саны',
            sections_left: "Қайталауға қалған бөлімдер саны",
            studied_sections: "Зерттелген бөлімдер",
            unstudied_sections: 'Қайта зерттеуге арналған бөлімдер',
            seconds_per_section: 'Әр бөлімге жауап беруге бөлінетін секунд саны',
        },

        questions: {
            question: 'Сұрақ',
            answered_questions: 'Жауап берілген сұрақтар',
            unanswered_questions: 'Жауап берілмеген сұрақтар',
            number_of_answer_attempts: 'Жауап беруге арналған әрекеттер саны',
            added_questions_count: 'Қосылған сұрақтар саны',
            select_questions: 'Сұрақтарды таңдау',
            question_settings: 'Сұрақтарды өңдеу',
            questions_left: "Қалған сұрақтар саны",
            seconds_per_question: 'Әр сұраққа жауап беруге бөлінетін секунд саны',
            predefined_answer: 'Алдын ала анықталған жауап'
        },

        tasks: {
            title: 'Тапсырмалар',
            task_slug: 'Тапсырманың негізгі тілдегі атауы',
            task_name: 'Тапсырманың атауы',
            task_type: 'Тапсырманың түрі',
            add_a_task: 'Тапсырма қосу',
            adding_a_task: 'Тапсырма қосу',
            delete_task: "Тапсырманы жою",
            delete_confirm: "Сіз бұл тапсырманы шынымен жойғыңыз келе ме?",
            start_the_task: 'Тапсырманы бастау',
            complete_the_task: 'Тапсырманы аяқтау',
            start_the_test: 'Тестілеуді бастау',
            test_is_started: 'Тестілеу басталды',
            test_is_started_for_learners: 'Тестілеу басталды. Оқушылар дәл қазір тапсырмаларды орындауға кірісті.',
            continue_the_test: 'Тестілеуді жалғастыру',
            count: 'Тапсырмалар саны',
            tasks_count: 'Тапсырмалар',
            there_are_no_tasks: 'Бұл сабаққа әзірше тапсырмалар қосылмаған.',
            task_materials: 'Тапсырманың материалдары',
            try_again: 'Қайта орындау',
            next_task: 'Келесі тапсырма',
            run: 'Тапсырманы іске қосу',
            launched: 'Тапсырма іске қосылды',
            not_launched: 'Тапсырма әзірше іске қосылған жоқ',
            is_available: 'Тапсырма орындауға қолжетімді',
            is_unavailable: 'Тапсырма әзірше қолжетімсіз',
            allowed_only_participants: 'Доступ к заданиям разрешён только участникам этой конференции.',
            completed_the_task: '{name} "{taskName}" тапсырмасын орындап болды.',
            new_task_is_available: 'Сізге "{taskName}" тапсырмасы қолжетімді. Оны төмендегі "Тапсырмалар" қойындысынан аша аласыз.',
            is_completed: 'Тапсырма орындалды',
            in_process: 'Тапсырма орындап жатыр',
            in_process_this: 'Осы тапсырманы орындап жатыр',
            is_being_reviewed: 'Тапсырма тексерілуде',
            not_been_completed_yet: 'Тапсырма әзірше орындалған жоқ',
            show_task_result: 'Нәтижесін көру',
            show_learner_task_result: 'Оқушы тапсырмасының нәтижесін көру',
            you_can_see_the_result: 'Оқушы тапсырмасының нәтижесін ол орындалғаннан кейін көре аласыз',
            warning_1: 'Кейбір оқушылар әлі де тапсырма орындап жатыр. Өтінеміз, олардың тапсырманы аяқтауын күтіңіз немесе олардан тапсырманы жабуды сұраңыз.',
            task_options: {
                title: 'Тапсырманың баптаулары',
                task_example: 'Тапсырманың мысалы',
                task_example_message: 'Сіз мында тапсырманың мысалын енгізе аласыз',
                show_task_example: 'Тапсырманың мысалын көрсету',
                show_audio_button: 'Аудиобатырманы көрсету',
                play_audio_at_the_begin: 'Тапсырманың басында аудионы ойнату',
                play_audio_with_the_correct_answer: 'Аудионы дұрыс жауап берген кезде ойнату',
                play_error_sound_with_the_incorrect_answer: 'Дұрыс емес жауап бергенде қате дыбысын ойнату',
                show_image: 'Суретін көрсету',
                show_word: 'Аударылатын сөзді көрсету',
                show_transcription: 'Транскрипциясын көрсету',
                show_translate: 'Аудармасын көрсету',
                impression_limit: 'Көрсету шектеуі',
                choose_one_of_the_methods_for_matching_words: 'Сөздерді сәйкестендіру әдістерінің кем дегенде біреуін таңдаңыз',
                choose_one_of_the_methods_for_matching_words_by_pictures: 'Суреттерге сай сөздерді сәйкестендіру әдістерінің біреуін таңдаңыз',
                match_by_typing: 'Сөзді енгізу арқылы сәйкестендіру',
                match_by_clicking: 'Сөзге басу арқылы сәйкестендіру',
                match_by_drag_and_drop: 'Сүйреп апару арқылы сәйкестендіру'
            },
            translate: {
                kk: 'Тапсырманың қазақша тілдегі атауы',
                ru: 'Тапсырманың орысша тілдегі атауы',
                en: 'Тапсырманың ағылшынша тілдегі атауы',
                from_the_main_lang_to_the_current_lang: 'Негізгі тілден сайттың ағымдағы тіліне аудару',
                from_the_current_lang_to_the_main_lang: 'Cайттың ағымдағы тілінен негізгі тілге аудару'
            },
            missing_letters: {
                select_letters: 'Әріптерді таңдау',
                note_1: 'Сөзден алып тастау керек әріптерді таңдаңыз'
            },
            missing_words: {
                options: {
                    option_1: 'Сөйлемдегі бос орынды толықтыру (ұсынымдар арқылы)',
                    option_2: 'Сөйлемдегі бос орынды толықтыру (ұсыным жоқ)',
                    option_3: 'Сөйлемдегі бос орынды толықтыру (бірінші әріп)',
                    option_4: 'Сөйлемдегі бос орынды толықтыру (нұсқалар арқылы)'
                },
                note_1: 'Сөйлемнен жасыру қажет сөзді таңдаңыз.'
            },
            match_words_by_pictures: {
                option_1: 'Суреттерге сөздерін жазу арқылы сәйкестендіру',
                option_2: 'Суреттердің реттік нөмірлерін енгізу арқылы сәйкестендіру',
            },
            find_an_extra_word: {
                note_1: 'Бөлім қосыңыз. Бөлімге кем дегенде үш сөзден тұратын жиынтық жасаңыз, олардың біреуі артық болуы керек. Мысалы: сәрсенбі, бейсенбі, мамыр, жұма (мұнда "мамыр" артық). Әдепкіде артық сөз белгіленбейді. Сіз сөзді артық деп белгілеу үшін оны басып таңдауыңыз қажет. Сөз жиынтығы бар бөлімдерді шексіз қосуға болады.',
                extra_words_count_error: 'Әр бөлімдегі бір сөзді артық ету үшін сол сөзге басыңыз'
            },
            match_same_words: {
                note_1: 'Секция қосыңыз. Секцияда кемінде екі сөзден тұратын жиынтық жасаңыз, мұнда бірінші сөз ғана көрінеді, ал қалғандары сәйкестендіру үшін жасырылған болады. Осындай сөз жиынтықтары бар кез келген сандағы секцияларды қосуға болады.',
                note_2: 'Екпін түсетін әріптерді таңдаңыз.'
            },
            true_or_false: {
                true: "Шын",
                false: "Жалған",
                "doesn't_say": "Сілтеме жоқ",
                undefined: "Жауап берілмеді"
            },
            find_the_stressed_syllable: {
                note_1: 'Әр сөзді буындарға бөліңіз, содан кейін әр сөздегі бір буынды екпінді ретінде таңдаңыз және белгілеңіз.'
            },
            answer_the_questions: {
                answer_type: 'Сұраққа жауап беру әдісін таңдаңыз',
                options: {
                    option_1: 'Мәтін ретіндегі жауап',
                    option_2: 'Бейне ретіндегі жауап',
                    option_3: 'Аудио ретіндегі жауап',
                },
            },
            check: {
                by_ai: 'Жауапты ЖИ арқылы тексеру',
                by_mentor: 'Жауапты тәлімгер арқылы тексеру',
            },
            search_filter: 'Тапсырманы іздеу сүзгісі'
        },

        'checking-tasks': {
            title: 'Тапсырмаларды тексеру'
        },

        training: {
            title: 'Жаттығу',
            keyboard: {
                title: 'Әріптерді таңдау үшін пернетақтаны пайдалануыңызға да болады',
                numbers: 'Жауапты таңдау үшін пернетақтадағы сандарды да пайдалануыңызға болады',
                warning: 'Тиісті тіл үшін пернетақта орналасуын өзгерту керек'
            },
            word_translation: {
                title: 'Сіздің біліміңізді тексеріп көрейік',
                description: 'Бұл сөздің ағылшын тіліндегі аудармасын табыңыз'
            }
        },

        files: {
            title: "Файл сақтау орны",
        }
    }
}