export default {
    all: 'Все',
    yes: 'Да',
    no: 'Нет',
    you: 'Это вы',
    start: 'Начать',
    finish: 'Закончить',
    create: 'Создать',
    created: 'Создано',
    add: 'Добавить',
    added: 'Добавлен',
    not_added: 'Не добавлен',
    user_added: 'Добавлен(-а)',
    user_not_added: 'Не добавлен(-а)',
    delete: 'Удалить',
    instructions: 'Инструкции',
    result: 'Результат',
    results: 'Результаты',
    verified: 'Проверено',
    not_verified: 'Не проверено',
    passed: 'Выполнено',
    choose: "Выбрать",
    choose_an_option: "Выберите вариант",
    choose_your_option: "Выберите свой вариант",
    download: "Скачать",
    loading: "Идет загрузка",
    export_to_png: "Экспорт в PNG",
    export_to_xlsx: "Экспорт в XLSX",
    export_to_pdf: "Экспорт в PDF",
    click_to_listen_to_the_audio: "Кликните чтобы прослушать аудио",
    all_rights: 'Все права защищены.',
    choose_your_language: 'Выберите Ваш язык',
    choose_a_mentor: 'Выберите куратора',
    choose_a_category: 'Выберите категорию',
    continue: 'Продолжить',
    merge: "Объединить",
    split: "Разделить",
    move_up: "Переместить вверх",
    move_down: "Переместить вниз",
    move_left: "Переместить влево",
    move_right: "Переместить вправо",
    save: 'Сохранить',
    saving: 'Сохранение',
    generate: "Cгенерировать",
    restart: 'Перезагрузить',
    edit: "Редактировать",
    welcome: 'Добро пожаловать!',
    you_are_on_the_main_page: 'Мы рады видеть вас на главной странице нашего сайта.',
    online: 'В сети',
    offline: 'Не в сети',
    or: 'Или',
    back: 'Назад',
    close: 'Закрыть',
    check: 'Проверить',
    swap_places: 'Поменять местами',
    an_error_occurred: 'Произошла ошибка',
    nothing_was_found_for_your_query: "По вашему запросу ничего не найдено",
    time_is_up: "Время вышло!",
    remaining_time: "Оставшееся время",
    write_here_and_press_add: "Напишите здесь и затем нажмите на кнопку 'Добавить'",

    sort_by_this_column: 'Сортировать по данному столбцу',
    sort_asc: 'Сортировка по возрастанию',
    sort_desc: 'Сортировка по убыванию',

    status: "Статус",
    invite: "Пригласить",
    search: "Искать",
    accept: "Принять",

    operator: "Оператор",
    executor: "Исполнитель",
    mentor: "Куратор",
    learner: "Ученик",
    applicant: "Заявитель",
    recipient: "Получатель",
    selected: "Выбрано",
    not_selected: "Не выбрано",
    not_specified: "Не указано",
    your_answer: "Ваш ответ",
    learner_answer: "Ответ ученика",
    type_your_answer: "Введите ваш ответ",
    no_answer: "Нет ответа",
    title: "Заголовок",
    text_center: "Текст по центру",
    right: "Правильно!",
    wrong: "Неправильно!",
    right_answer: "Правильный ответ",
    right_answers: "Правильные ответы",
    right_answers_count: "Правильных ответов",
    wrong_answer: "Неправильный ответ",
    wrong_answers: "Неправильные ответы",
    wrong_answers_count: "Неправильных ответов",
    unverified_answer: "Непроверенный ответ",
    unverified_answers: "Непроверенные ответы",
    unverified_answers_count: "Непроверенных ответов",
    answer_options: "Варианты ответа",
    message: "Сообщение",
    write_a_comment: "Напишите комментарий",
    comment: "Комментарий",
    comments: "Комментарии",
    for_re_examination: "Для повторного изучения",
    get_ready: "Приготовьтесь",
    number_of_options: "Количество вариантов",
    number_of_attempts: "Количество попыток на исправление ошибок",
    random_order: "Выводить в случайном порядке",
    random_order_words: "Выводить слова в случайном порядке",
    random_order_pictures: "Выводить изображения в случайном порядке",

    created_at: "Дата создания",
    created_at_from: "Дата создания (с)",
    created_at_to: "Дата создания (по)",
    registered_at: "Дата регистрации",
    registered_at_from: "Дата регистрации (с)",
    registered_at_to: "Дата регистрации (по)",
    completed_at: "Дата выполнения",
    completed_at_from: "Дата выполнения (с)",
    completed_at_to: "Дата выполнения (по)",

    reset_search_filter: "Сбросить фильтр",
    show_search_filter: 'Показать фильтр поиска',
    hide_search_filter: 'Скрыть фильтр поиска',

    years: 'Годы',
    year: 'Год',
    month: 'Месяц',
    week: 'Неделя',
    day: 'День',

    start_time: 'Время начала',
    end_time: 'Время окончания',
    no_events: 'Нет мероприятии',
    yet_another: 'Ещё',

    theme: {
        switch_to_a_light_theme: "Переключиться на светлую тему",
        switch_to_a_dark_theme: "Переключиться на темную тему"
    },

    file: {
        file: "Файл",
        files: "Файлы",
        name: "Название файла",
        size: "Размер файла",
        type: "Тип файла",
        disk_info: "Информация о дисковом пространстве",
        show_disk_info: "Показать диск",
        hide_disk_info: "Скрыть диск",
        search_filter: "Фильтр поиска файлов",
        choose_a_file: "Выберите файл",
        choose_a_file_type: "Выберите тип файла",
        specify_the_file_name: "Укажите название файла",
        specify_the_file_type: "Укажите тип файла",
        selected_file: "Выбранный Вами файл",
        change_file: "Выбрать другой файл",
        file_ready_to_upload: "Файл готов к загрузке",
        upload: "Загрузить",
        upload_file: "Загрузить файл",
        uploading_a_new_file: "Загрузка нового файла",
        uploading_file: "Идет загрузка файла...",
        upload_from_media: "Выбрать из ранее загруженных",
        generate: "Cгенерировать с помощью ИИ",
        deleting_a_file: "Удаление файла",
        file_delete_confirm: "Вы действительно хотите удалить данный файл? Все связанное с ним будет также удалено.",
        kilobyte: "КБ",
        megabyte: "МБ",
        gigabyte: "ГБ",
        total_space: "Общее пространство",
        free_space: "Свободно",
        used_space: "Занято",
        increase_the_space: "Увеличить место",
        lack_of_disk_space: "Не хватает места на диске для загрузки данного файла. Для увеличения места на диске Вам нужно перейти на более высокий тарифный план.",
        choose_file: "Выберите файл",
        image: {
            select: "Выберите файл изображения",
            current: "Текущий загруженный файл изображения"
        },
        audio: {
            select: "Выберите аудиофайл",
            current: "Текущий загруженный аудиофайл",
            voice: "Голос",
        },
        video: {
            select: "Выберите видеофайл",
            current: "Текущий загруженный видеофайл"
        }
    },

    materials: {
        title: "Материалы",
        material: "Материал",
        add_material: "Добавить материал",
        edit_material: "Редактирование материала",
        delete_material: "Удаление материала",
        delete_confirm: "Вы действительно хотите удалить данный материал?",
        materials_count: "Материалов",
        sentence_materials: "Материалы фраз",
        annotation: 'Краткое описание (аннотация)',
        display: 'Показать ученикам',
        display_title: 'Показать материал ученикам',
        displayed: 'Ученики видят материал',
        displayed_title: 'Ученики видят данный материал',
        learn: {
            video: "Для ознакомления с материалом задания внимательно просмотрите данное видео",
            audio: "Для ознакомления с материалом задания внимательно прослушайте данное аудио",
            image: "Для ознакомления с материалом задания внимательно просмотрите данное изображение",
            text: "Для ознакомления с материалом задания внимательно прочитайте данный текст",
            table: "Для ознакомления с материалом задания внимательно проcмотрите данную таблицу"
        },
        show_materials_option: {
            use_both_options: "Использовать оба варианта",
            show_materials_during_a_task: "Показывать материалы во время выполнения задания",
            show_materials_before_starting_a_task: "Показывать материалы перед началом выполнения задания"
        }
    },

    text: {
        welcome: "Вы можете редактировать данный текст",
        bold: "Жирный",
        italic: "Курсивный",
        underline: "Подчеркнутый",
        strikethrough: "Зачеркнутый",
        title: "Заголовок",
        li: "Маркерный список",
        ol: "Нумерованный список",
        text_left: "Выравнивание по левому краю",
        text_center: "Выравнивание по центру",
        text_right: "Выравнивание по правому краю"
    },

    table: {
        create: "Создать таблицу",
        copy_and_paste_the_table_here: "Скопируйте таблицу и вставьте сюда",
        rows_count: "Количество строк",
        add_row: "Добавить строку",
        delete_rows: "Удалить строки",
        columns_count: "Количество столбцов",
        add_column: "Добавить столбец",
        delete_columns: "Удалить столбцы",
        delete_table: "Удалить таблицу",
        table_options: "Настройки таблицы",
        has_header: "Таблица с заголовками",
        is_small: "Компактная таблица",
        is_striped: "Полосатая таблица",
        is_bordered: "Таблица с границей",
        error_1: "Количество строк и столбцов должно быть выше 1",
        error_2: "Нельзя удалять все строки!",
        error_3: "Нельзя удалять все столбцы!",
        error_4: "Для начала Вам нужно создать таблицу",
        confirm_1: "Вы уверены, что хотите удалить таблицу?"
    },

    pagination: {
        first_page_title: "Перейти на первую страницу",
        previous_page_title: "Перейти на предыдущую страницу",
        next_page_title: "Перейти на следующую страницу",
        last_page_title: "Перейти на последнюю страницу",
        limit_per_page: "Лимит на страницу",
        unlimit: "Без ограничении",
        shown: "Показано: {shown} из {total}"
    },

    errors: {
        page_is_not_available: "Эта страница недоступна для данной роли",
        show_error: "Показать ошибку",
        hide_error: "Скрыть ошибку",
        media: {
            camera_error: 'Не удается получить доступ к камере и микрофону.',
            screen_sharing_error: 'Демонстрация на этом устройстве недоступна либо ограничена.'
        },
        server: {
            error: 'Невозможно подключиться к серверу. Проверьте соединение с интернетом.',
            room_error: 'Не удается войти в конференцию. Попробуйте перезагрузить страницу.',
            peer_error: 'Не удается установить P2P соединение.  Проверьте соединение с интернетом.'
        },
        statuses: {
            status_undefined: "Неизвестная ошибка!",
            status_400: "Непредвиденная ошибка на сервере!",
            status_401: "Вы не авторизованы!",
            status_403: "Доступ к данной странице запрещен!",
            status_404: "Запрашиваемая страница не найдена!",
            status_500: "Ошибка на стороне сервера!"
        }
    },

    form: {
        email: 'Эл.почта',
        first_name: 'Имя',
        last_name: 'Фамилия',
        phone: 'Телефон',
        password: 'Пароль',
        new_password: 'Новый пароль',
        password_confirmation: 'Подтвердите пароль',
        new_password_confirmation: 'Подтвердите новый пароль',
        school_name: 'Название школы',
        school_domain: 'Доменное имя школы',
        country: 'Страна',
        region: 'Регион',
        city: 'Город',
        street: 'Улица',
        house: 'Дом',
        flat: 'Квартира'
    },

    board: {
        show_tool_parameters: 'Показать свойства инструмента',
        tool_parameters: 'Свойства инструмента',
        font_size: 'Размер шрифта',
        tools: {
            move: 'Перемещение',
            pencil: 'Карандаш',
            brush: 'Кисть',
            line: 'Линия',
            rectangle: 'Прямоугольник',
            circle: 'Круг',
            text: 'Текст',
            eraser: 'Ластик'
        },
        params: {
            text_color: 'Цвет текста',
            border_color: 'Цвет обводки',
            fill_color: 'Цвет заливки',
            cell_color: 'Цвет ячейки',
            border_width: 'Толщина линии',
            text_params: 'Параметры текста'
        },
        actions: {
            redo: 'Вернуть',
            undo: 'Отменить',
            clear: 'Очистить',
            save: 'Сохранить'
        }
    },

    pages: {
        error: {
            title: 'Произошла ошибка'
        },

        home: {
            title: 'Главная страница',
            hello: 'Добро пожаловать',
            to: "На главную страницу",
        },

        profile: {
            title: 'Мой профиль',
        },

        auth: {
            title: 'Авторизация'
        },

        login: {
            title: 'Вход в систему',
            sign_in: 'Войти',
            dont_have_an_account: "Нет аккаунта?",
            forgot_password: "Забыли пароль?",
            password_recovery: "Восстановить",
            sign_out: 'Выйти из аккаунта',
        },

        register: {
            title: 'Регистрация',
            have_an_account: 'У меня есть акканут.',
        },

        "password-recovery": {
            title: 'Восстановление пароля',
            invalid: 'Ссылка для восстановления пароля уже недействительна. Попробуйте восстановить пароль заново.',
            send: 'Мы отправили письмо со ссылкой для восстановления пароля на указанный вами адрес электронной почты. Пожалуйста, проверьте ваш почтовый ящик, включая папку «Спам».'
        },

        "change-password": {
            title: 'Изменение пароля',
            inst_1: 'Здравствуйте, {name}! Пожалуйста, придумайте новый пароль и подтвердите его. Убедитесь, что он надежный и содержит не менее 8 символов. После этого вы сможете снова войти в свой аккаунт.',
        },

        dashboard: {
            title: 'Личный кабинет',
            go_to_dashboard: 'Перейти в личный кабинет',
        },

        "users-groups": {
            title: 'Пользователи и группы',
        },

        users: {
            title: 'Пользователи',
            invite_user_title: "Приглашение нового пользователя",
            edit_user_title: "Редактирование данных пользователя",
            user_mode: 'Моя текущая роль',
            user_info: "Информация о пользователе",
            user_status: "Статус пользователя",
            user_role: "Роль пользователя",
            select_user_roles: "Выберите роль-(и) для нового пользователя",
            search_filter: "Фильтр поиска пользователей",
        },

        groups: {
            title: 'Группы',
            group: 'Группа',
            choose: 'Выберите группу',
            create_group: "Создать новую группу",
            saving_a_group: "Сохранение группы",
            create_group_title: "Создание новой группы",
            edit_group_title: "Редактирование группы",
            group_name: "Название группы",
            group_category: "Категория группы",
            group_description: "Описание группы",
            search_filter: "Фильтр поиска группы",
            add_members_to_group: "Добавление участников в группу",
            edit_group_members: "Редактирование участников",
            members: "Участники группы",
            members_count: "Количество участников",
            added_members_count: "Количество добавленных участников",
            note_1: "Чтобы добавить участников в группу кликните по ним в таблице ниже",
            warning_1: "Данный участник уже добавлен в группу",
            not_member: "Не состоит в группе",
            belongs_to_another_group: "Состоит в другой группе"
        },

        schedule: {
            title: 'Расписание',
            search_filter: 'Фильтр поиска по расписанию',
            start_date: 'Дата начала занятии',
            start_date_from: 'Дата начала занятии (с)',
            start_date_to: 'Дата начала занятии (по)',
            end_date: 'Дата окончания занятии',
            start_time: 'Время начала занятии',
            end_time: 'Время окончания занятии',
        },

        events: {
            title: 'Мероприятия',
            no_events: 'Никаких мероприятий на этот день не запланировано.'
        },

        conference: {
            title: 'Видеоконференция',
            create: 'Создать конференцию',
            create_conference: 'Создание конференции',
            delete_conference: 'Удаление конференции',
            delete_confirm: 'Вы действительно хотите удалить данную конференцию?',
            mic: 'Микрофон',
            mic_turn_on: 'Включить микрофон',
            mic_turn_off: 'Отключить микрофон',
            video: 'Видео',
            video_turn_on: 'Включить видео',
            video_turn_off: 'Отключить видео',
            demo: 'Демо',
            demo_turn_on: 'Запустить демонстрацию экрана',
            demo_turn_off: 'Остановить демонстрацию экрана',
            board: 'Доска',
            participants: 'Участники',
            participants_count: 'Количество участников',
            chat: 'Сообщения',
            search_conference: 'Поиск конференции',
            join: 'Войти в конференцию',
            until_the_start_of_the_conference: 'Осталось до начала конференции:',
            no_current_conferences: 'На данный момент нет текущих конференций.',
            not_appointed: 'Похоже, вы ещё не назначены куратором какой-либо группы. Пожалуйста, свяжитесь с администратором школы, чтобы решить этот вопрос. Если вы являетесь администратором, вам необходимо создать группу.',
            assign_a_mentor_only_for_this_lesson: 'Назначить куратором только на этот урок',
            appoint_a_mentor_for_this_and_subsequent_lessons: 'Назначить куратором на этот и последующие уроки',
            appoint_a_mentor_for_this_and_subsequent_lessons_note: 'Выбранный вами куратор будет закреплён за этим и последующими уроками данной группы.',
            you_cant_create_a_conference: 'Вы не можете создать новую конференцию, так как в данный момент уже проводится другая. Пожалуйста, дождитесь её завершения или удалите текущую конференцию.',
            mode: {
                grid: 'Сетка',
                slider: 'Карусель'
            },
            messages: {
                requesting_access: 'Получение доступа к камере и микрофону'
            },
            statuses: {
                current: 'Текущие',
                planned: 'Запланированные',
                passed: 'Пройденные',
            }
        },

        "operations-requests": {
            title: 'Операции и запросы',
        },

        operations: {
            title: "Операции",
            operation_type: "Тип операции",
            search_filter: "Фильтр поиска операции",
            description: "Описание операции"
        },

        requests: {
            title: "Запросы",
            request_type: "Тип запроса",
            search_filter: "Фильтр поиска запросов",
            description: "Описание запроса"
        },

        notifications: {
            title: 'Уведомления',
            there_are_no_new_notifications: 'Новых уведомлений нет'
        },

        courses: {
            title: 'Курсы',
            my_courses: 'Мои курсы',
            course: 'Курс',
            choose_a_course: 'Выберите курс',
            course_level: 'Категория курса',
            choose_a_course_level: 'Выберите категорию курса',
            course_section: 'Глава',
            choose_a_course_section: 'Выберите главу',
            course_is_not_available: 'Курс недоступен. Пожалуйста, свяжитесь с администратором для получения доступа к курсу.',
        },

        lessons: {
            title: 'Уроки',
            lessons_count: 'Уроков',
            there_is_no_lessons: 'Нет уроков',
            lesson: 'Урок',
            lesson_name: 'Название урока',
            lesson_description: 'Краткое описание урока',
            choosing_a_lesson: 'Выбор урока',
            choose_a_lesson: 'Выберите урок',
            lesson_type: 'Тип урока',
            choose_a_lesson_type: 'Выберите тип урока',
            add_lesson: 'Добавить урок',
            add_unit: 'Добавить главу',
            add_unit_title: 'Добавление главы',
            unit_name: 'Название главы',
            lesson_materials: 'Материалы урока',
            there_are_no_materials: 'Для этого урока пока не добавлены материалы.',
            is_unavailable: 'Урок временно недоступен',
            is_unavailable_desc: 'Данный урок будет доступен после проведения конференции с куратором.',
            start_date: 'Дата проведения урока (конференции)',
            start_time: 'Время проведения урока (конференции)',
            date_shift_couple: 'Сдвинуть дату проведения урока данной группы максимум на два календарных дня',
            date_shift_by_week: 'Сдвинуть дату проведения этого и последующих уроков данной группы относительно выбранной даты',
            date_shift_by_week_note: 'При выборе новой даты текущего урока система автоматически пересчитает даты всех последующих уроков в рамках этой группы, сохранив исходный интервал между ними. К примеру если уроки проводятся с интервалом в одну неделю, то каждая следующая дата будет смещена ровно на 7 дней от предыдущей, начиная с новой выбранной даты.',
        },

        "add-lesson": {
            title: 'Добавление урока'
        },

        "education-program": {
            title: 'Учебная программа'
        },

        dictionary: {
            title: 'Словарь',
            word: 'Cлово',
            count: 'Количество слов',
            options: 'Настройки словаря',
            this_word_is_hidden: 'Данное слово скрытое',
            hide_this_word: 'Скрыть это слово',
            this_word_is_extra: 'Данное слово указано лишним',
            make_this_word_extra: 'Указать это слово как лишний',
            select_words: 'Выбор слов',
            studied_words: 'Изученные слова',
            unstudied_words: 'Слова на переизучение',
            added_words_count: 'Количество добавленных слов',
            exactly_words_count_error: 'Количество добавленных слов должно составлять ровно {count}',
            min_words_count_error: 'Количество добавленных слов должно составлять как минимум {count}',
            add: 'Добавить словарь',
            add_section: 'Добавить секцию',
            add_these_words_to_the_section: 'Добавить эти слова в секцию',
            add_word_title: 'Добавление слова в словарь',
            words_left: "Осталось слов на повторение",
            edit_word_title: 'Редактирование слова',
            transcription: 'Транскрипция',
            seconds_per_word: 'Количество выделенных секунд на ответ каждого слова',
            required: 'Слово обязательно для заполнения',
            category_slug: 'Название категории на основном языке',
            translate: {
                kk: 'Перевод слова на казахском языке',
                ru: 'Перевод слова на русском языке',
                category_kk: 'Название категории на казахском языке',
                category_ru: 'Название категории на русском языке',
            },
            search_filter: 'Фильтр поиска по словарю'
        },

        sentences: {
            title: 'Фразы',
            sentence: 'Фраза',
            select_sentences: 'Выбор фраз',
            studied_sentences: 'Изученные фразы',
            unstudied_sentences: 'Фразы на переизучение',
            added_sentences_count: 'Количество добавленных фраз',
            sentences_left: "Осталось фраз на повторение",
            add_sentence_title: 'Добавление фразы',
            edit_sentence_title: 'Редактирование фразы',
            transcription: 'Транскрипция',
            seconds_per_sentence: 'Количество выделенных секунд на ответ каждой фразы',
            required: 'Фраза обязательна для заполнения',
            translate: {
                kk: 'Перевод фразы на казахском языке',
                ru: 'Перевод фразы на русском языке'
            },
            search_filter: 'Фильтр поиска по фразам'
        },

        sections: {
            added_sections_count: 'Количество добавленных секций',
            sections_left: "Осталось секций на повторение",
            studied_sections: "Изученные секции",
            unstudied_sections: 'Секции для переизучения',
            seconds_per_section: 'Количество выделенных секунд на ответ каждой секции',
        },

        questions: {
            question: 'Вопрос',
            answered_questions: 'Отвеченные вопросы',
            unanswered_questions: 'Неотвеченные вопросы',
            number_of_answer_attempts: 'Количество попыток ответа на вопрос',
            added_questions_count: 'Количество добавленных вопросов',
            select_questions: 'Выбор вопросов',
            question_settings: 'Настройка вопросов',
            questions_left: "Осталось вопросов",
            seconds_per_question: 'Количество выделенных секунд на ответ каждого вопроса',
            predefined_answer: 'Предопределенный ответ',
        },

        tasks: {
            title: 'Задания',
            task_slug: 'Название задания на основном языке',
            task_name: 'Название задания',
            task_type: 'Тип задания',
            add_a_task: 'Добавить задание',
            adding_a_task: 'Добавление задания',
            delete_task: "Удаление задания",
            delete_confirm: "Вы действительно хотите удалить данное задание?",
            start_the_task: 'Начать задание',
            complete_the_task: 'Завершить задание',
            start_the_test: 'Начать тестирование',
            test_is_started: 'Тестирование запущено',
            test_is_started_for_learners: 'Тестирование запущено. Ученики только что приступили к выполнению задании.',
            continue_the_test: 'Продолжить тестирование',
            count: 'Количество задании',
            tasks_count: 'Задании',
            there_are_no_tasks: 'Для этого урока пока не добавлены задания.',
            task_materials: 'Материалы задания',
            try_again: 'Пройти заново',
            next_task: 'Следующее задание',
            run: 'Запустить задание',
            launched: 'Задание уже запущено',
            not_launched: 'Задание еще не запущено для выполнения',
            is_available: 'Задание уже доступно для выполнения',
            is_unavailable: 'Задание пока недоступно',
            allowed_only_participants: 'Доступ к заданиям разрешён только участникам этой конференции.',
            completed_the_task: '{name} выполнил(-а) задание "{taskName}".',
            new_task_is_available: 'Вам доступно задание "{taskName}". Вы можете открыть его внизу во вкладке "Задания".',
            is_completed: 'Задание выполнено',
            in_process: 'Выполняет задание',
            in_process_this: 'Выполняет данное задание',
            not_been_completed_yet: 'Задание еще не выполнено',
            show_task_result: 'Показать результат',
            show_learner_task_result: 'Просмотреть результат задания ученика',
            you_can_see_the_result: 'Вы можете увидеть результат задания ученика как только оно будет выполнено',
            warning_1: 'Некоторые ученики все еще выполняют задание. Пожалуйста, дождитесь, пока они завершат выполнение, либо попросите их закрыть задание вручную.',
            task_options: {
                title: 'Настройки задания',
                task_example: 'Пример задания',
                task_example_message: 'Вы можете ввести здесь пример задания',
                show_task_example: 'Показывать пример задания',
                show_audio_button: 'Показывать аудиокнопку',
                play_audio_at_the_begin: 'Проигрывать аудио в начале задания',
                play_audio_with_the_correct_answer: 'Проигрывать аудио при правильном ответе',
                play_error_sound_with_the_incorrect_answer: 'Проигрывать звук ошибки при неправильном ответе',
                show_image: 'Показывать изображение',
                show_word: 'Показывать переводимое слово',
                show_transcription: 'Показывать транскрипцию',
                show_translate: 'Показывать перевод',
                impression_limit: 'Лимит показов',
                choose_one_of_the_methods_for_matching_words: 'Выберите хотя бы один из методов для сопоставления слов',
                choose_one_of_the_methods_for_matching_words_by_pictures: 'Выберите один из методов для сопоставления слов по изображениям',
                match_by_typing: 'Сопоставление с помощью ввода слова',
                match_by_clicking: 'Сопоставление с помощью клика',
                match_by_drag_and_drop: 'Сопоставление с помощью перетаскивания'
            },
            translate: {
                kk: 'Название задания на казахском языке',
                ru: 'Название задания на русском языке',
                en: 'Название задания на английском языке',
                from_the_main_lang_to_the_current_lang: 'Перевод с основного языка на текущий язык сайта',
                from_the_current_lang_to_the_main_lang: 'Перевод с текущего языка сайта на основной язык'
            },
            missing_letters: {
                select_letters: 'Выбор букв',
                note_1: 'Выберите буквы, которые следует скрыть из слова.'
            },
            missing_words: {
                options: {
                    option_1: 'Заполнить пропуск во фразе (с подсказками)',
                    option_2: 'Заполнить пропуск во фразе (без подказок)',
                    option_3: 'Заполнить пропуск во фразе (с первой буквой)',
                    option_4: 'Заполнить пропуск во фразе (с одним из вариантов)'
                },
                note_1: 'Кликните на слово, которое нужно скрыть из фразы.'
            },
            match_words_by_pictures: {
                option_1: 'Сопоставление путем вписания слов в изображения',
                option_2: 'Сопоставление путем вписания порядковых номеров изображении',
            },
            find_an_extra_word: {
                note_1: 'Добавьте секцию. В секции создайте набор как минимум из трёх слов на основе словаря, одно из которых должно быть лишним. Например, среда, четверг, май, пятница (где "май" является лишним). По умолчанию лишнее слово не указано. Вы должны отметить слово как лишнее, кликнув на него. Допускается добавление неограниченного количества секций с наборами слов.',
                extra_words_count_error: 'Кликните по одному из слов в каждой секции, чтобы сделать его лишним'
            },
            match_same_words: {
                note_1: 'Добавьте секцию. В секции создайте набор как минимум из двух слов, где только первое слово будет видно, а остальные скрыты для сопоставления. Можно добавлять любое количество секций с такими наборами слов.',
                note_2: 'Выберите буквы, на которые падает ударение.'
            },
            true_or_false: {
                true: "Правда",
                false: "Ложь",
                "doesn't_say": "Нет упоминания",
                undefined: "Ответ не указан"
            },
            find_the_stressed_syllable: {
                note_1: 'Разделите каждое слово на слоги, затем выберите один слог в каждом слове и отметьте его как ударный.'
            },
            answer_the_questions: {
                answer_type: 'Выберите метод ответа на вопрос',
                options: {
                    option_1: 'Текстовый ответ',
                    option_2: 'Ответ с помощью видео',
                    option_3: 'Ответ с помощью аудио',
                },
            },
            check: {
                by_ai: 'Проверка ответа с помощью ИИ',
                by_mentor: 'Проверка ответа куратором',
            },
            search_filter: 'Фильтр поиска по заданиям'
        },

        'checking-tasks': {
            title: 'Проверка заданий'
        },

        training: {
            title: 'Тренировка',
            keyboard: {
                title: 'Вы также можете использовать клавиатуру для выбора букв',
                numbers: 'Вы также можете использовать цифры на клавиатуре для выбора ответа',
                warning: 'Вы должны поменять раскладку клавиатуры для соответствующего языка'
            },
            word_translation: {
                title: 'Проверим ваши знания',
                description: 'Найдите английский перевод этого слова'
            }
        },

        files: {
            title: 'Файловая библиотека'
        }
    }
}