<template>
  <div class="custom-grid">
    <div class="col-span-12">
      <h2>{{ $t("pages.privacy-policy.title") }}</h2>

      <p class="font-medium">1. Определения</p>
      <p>
        Интернет проект <span class="text-corp">www.easyspeak.kz</span> (далее - URL, «мы») серьезно
        относится к вопросу конфиденциальности информации своих клиентов и
        посетителей сайта <span class="text-corp">www.easyspeak.kz</span> (далее - «вы», «посетители
        сайта»). Персонифицированной мы называем информацию, содержащую
        персональные данные (например: ФИО, логин или название компании)
        посетителя сайта, а также информацию о действиях, совершаемых вами на
        сайте URL. (например: заказ посетителя сайта с его контактной
        информацией). Анонимными мы называем данные, которые невозможно
        однозначно идентифицировать с конкретным посетителем сайта (например:
        статистика посещаемости сайта).
      </p>

      <p class="font-medium">2. Использование информации</p>

      <p>
        Мы используем персонифицированную информацию конкретного посетителя
        сайта исключительно для обеспечения ему качественного оказания услуг и
        их учета. Мы не раскрываем персонифицированных данных одних посетителей
        сайта URL другим посетителям сайта. Мы никогда не публикуем
        персонифицированную информацию в открытом доступе и не передаем ее
        третьим лицам. Исключением являются лишь ситуации, когда предоставление
        такой информации уполномоченным государственным органам предписано
        действующим законодательством Республики Казахстан. Мы публикуем и
        распространяем только отчеты, построенные на основании собранных
        анонимных данных. При этом отчеты не содержат информацию, по которой
        было бы возможным идентифицировать персонифицированные данные
        пользователей услуг. Мы также используем анонимные данные для
        внутреннего анализа, целью которого является развитие продуктов и услуг
        URL
      </p>

      <p class="font-medium">3. Ссылки</p>

      <p>
        Сайт <span class="text-corp">www.easyspeak.kz</span> может содержать ссылки на другие сайты, не
        имеющие отношения к нашей компании и принадлежащие третьим лицам. Мы не
        несем ответственности за точность, полноту и достоверность сведений,
        размещенных на сайтах третьих лиц, и не берем на себя никаких
        обязательств по сохранению конфиденциальности информации, оставленной
        вами на таких сайтах.
      </p>

      <p class="font-medium">4. Ограничение ответственности</p>

      <p>
        Мы делаем все возможное для соблюдения настоящей политики
        конфиденциальности, однако, мы не можем гарантировать сохранность
        информации в случае воздействия факторов, находящихся вне нашего
        влияния, результатом действия которых станет раскрытие информации.
        Сайт <span class="text-corp">www.easyspeak.kz</span> и вся размещенная на нем информация
        представлены по принципу "как есть" без каких-либо гарантий. Мы не несем
        ответственности за неблагоприятные последствия, а также за любые убытки,
        причиненные вследствие ограничения доступа к сайту URL или вследствие
        посещения сайта и использования размещенной на нем информации.
      </p>

      <p class="font-medium">5. Контакты</p>

      <p>
        По вопросам, касающимся настоящей политики, просьба обращаться по адресу <b class="text-corp"><a href="mailto:info@easyspeak.kz">info@easyspeak.kz</a></b>
      </p>
    </div>
  </div>
</template>
<script setup>
const { t } = useI18n();
useHead({
  title: t("pages.privacy-policy.title"),
  meta: [{ name: "description", content: "My amazing site." }],
});
</script>
