<template>
  <div class="custom-grid">
    <div class="col-span-12">
      <h2>{{ $t("pages.refund-policy.title") }}</h2>

      <p>
        При проведении онлайн-оплаты посредством платежных карт не допускается
        возврат наличными денежными средствами. Порядок возврата регулируется
        правилами международных платежных систем:
      </p>

      <ol>
        <li>
          Потребитель вправе отказаться от услуги до истечения срока льготного
          периода в 14 календарных дней, в случае истечения срока льготного
          периода и списания оплаты за услугу возврат не оформляется;
        </li>
        <li>
          Потребитель не вправе отказаться от товара надлежащего качества,
          имеющего индивидуально-определенные свойства, если указанный товар
          может быть использован исключительно приобретающим его человеком;
        </li>
        <li>
          При отказе от товара со стороны потребителя продавец должен вернуть
          ему денежную сумму, уплаченную потребителем, не позднее чем через
          десять дней со дня предъявления потребителем соответствующего
          требования.
        </li>
      </ol>

      <p>
        Для возврата денежных средств на банковскую карту необходимо заполнить
        «Заявление о возврате денежных средств», которое высылается по
        требованию компанией на электронный адрес, и отправить его вместе с
        приложением копии документа, удостоверяющего личность, по адресу E-MAIL
        адрес. Возврат денежных средств будет осуществлен на банковскую карту в
        течение 14 рабочего дня со дня получения «Заявление о возврате денежных
        средств» Компанией.
      </p>

      <p>
        Для возврата денежных средств по операциям, проведенным с ошибками,
        необходимо обратиться с письменным заявлением и приложением копии
        документа, удостоверяющего личность, и чеков/квитанций, подтверждающих
        ошибочное списание. Данное заявление необходимо направить по
        адресу E-MAIL адрес.
      </p>

      <p>
        Сумма возврата будет равняться сумме покупки. Срок рассмотрения
        Заявления и возврата денежных средств начинает исчисляться с момента
        получения Компанией Заявления и рассчитывается в рабочих днях без учета
        праздников/выходных дней.
      </p>

      <p>Случаи отказа в совершении платежа:</p>

      <ul>
        <li>
          банковская карта не предназначена для совершения платежей через
          интернет, о чем можно узнать, обратившись в Ваш Банк-эмитент;
        </li>
        <li>
          недостаточно средств для оплаты на банковской карте. Подробнее о
          наличии средств на платежной карте Вы можете узнать, обратившись в
          банк, выпустивший банковскую карту;
        </li>
        <li>данные банковской карты введены неверно;</li>
        <li>
          истек срок действия банковской карты. Срок действия карты, как
          правило, указан на лицевой стороне карты (это месяц и год, до которого
          действительна карта). Подробнее о сроке действия карты Вы можете
          узнать, обратившись в банк-эмитент.
        </li>
      </ul>

      <p>
        По вопросам оплаты с помощью банковской карты и иным вопросам, связанным
        с работой сайта, Вы можете обратиться по следующим телефонам: ВАШ НОМЕР
        ТЕЛЕФОНА.
      </p>
    </div>
  </div>
</template>
<script setup>
const { t } = useI18n();
useHead({
  title: t("pages.refund-policy.title"),
  meta: [{ name: "description", content: "My amazing site." }],
});
</script>
