<template>
  <div class="custom-grid">
    <div class="col-span-12 text-justify hyphens-auto">
      <h2>{{ $t("pages.refund-policy.title") }}</h2>

      <div v-if="localeProperties.code === 'ru'">
        <p>
          При проведении онлайн-оплаты посредством платежных карт не допускается
          возврат наличными денежными средствами. Порядок возврата регулируется
          правилами международных платежных систем:
        </p>

        <ol class="pl-10 mb-4">
          <li>
            Потребитель вправе отказаться от услуги до истечения срока льготного
            периода в 14 календарных дней, в случае истечения срока льготного
            периода и списания оплаты за услугу возврат не оформляется;
          </li>
          <li>
            Потребитель не вправе отказаться от товара надлежащего качества,
            имеющего индивидуально-определенные свойства, если указанный товар
            может быть использован исключительно приобретающим его человеком;
          </li>
          <li>
            При отказе от товара со стороны потребителя продавец должен вернуть
            ему денежную сумму, уплаченную потребителем, не позднее чем через
            десять дней со дня предъявления потребителем соответствующего
            требования.
          </li>
        </ol>

        <p>
          Для возврата денежных средств на банковскую карту необходимо заполнить
          «Заявление о возврате денежных средств», которое высылается по
          требованию компанией на электронный адрес, и отправить его вместе с
          приложением копии документа, удостоверяющего личность, по адресу <b
            class="text-corp"
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >. Возврат денежных средств будет осуществлен на банковскую карту в
          течение 14 рабочего дня со дня получения «Заявление о возврате
          денежных средств» Компанией.
        </p>

        <p>
          Для возврата денежных средств по операциям, проведенным с ошибками,
          необходимо обратиться с письменным заявлением и приложением копии
          документа, удостоверяющего личность, и чеков/квитанций, подтверждающих
          ошибочное списание. Данное заявление необходимо направить по адресу <b
            class="text-corp"
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >.
        </p>

        <p>
          Сумма возврата будет равняться сумме покупки. Срок рассмотрения
          Заявления и возврата денежных средств начинает исчисляться с момента
          получения Компанией Заявления и рассчитывается в рабочих днях без
          учета праздников/выходных дней.
        </p>

        <p><b>Случаи отказа в совершении платежа:</b></p>

        <ul class="pl-10 mb-4">
          <li>
            банковская карта не предназначена для совершения платежей через
            интернет, о чем можно узнать, обратившись в Ваш Банк-эмитент;
          </li>
          <li>
            недостаточно средств для оплаты на банковской карте. Подробнее о
            наличии средств на платежной карте Вы можете узнать, обратившись в
            банк, выпустивший банковскую карту;
          </li>
          <li>данные банковской карты введены неверно;</li>
          <li>
            истек срок действия банковской карты. Срок действия карты, как
            правило, указан на лицевой стороне карты (это месяц и год, до
            которого действительна карта). Подробнее о сроке действия карты Вы
            можете узнать, обратившись в банк-эмитент.
          </li>
        </ul>

        <p>
          По вопросам оплаты с помощью банковской карты и иным вопросам,
          связанным с работой сайта, Вы можете обратиться по следующим
          телефонам: <b
            ><a :href="'tel:' + $contacts.phone" class="text-nowrap">{{
              $contacts.phone_format
            }}</a></b
          >.
        </p>
      </div>

      <div v-else-if="localeProperties.code === 'kk'">
        <p>
          Төлем картасы арқылы жасалған онлайн-төлем кезінде қаражат қолма-қол
          ақша болып қайтарылмайды. Қайтару тәртібі халықаралық төлем жүйелері
          ережелерімен реттеледі:
        </p>

        <ol class="pl-10 mb-4">
          <li>
            Тұтынушы тауар/ қызметтер берілгенге дейін кез келген уақытта одан
            бас тартуға құқылы. Ал берілгеннен кейін — тауарды қайтару 14 күн
            ішінде ресімделуі керек;
          </li>

          <li>
            Сапалы тауар қайтарылуы мүмкін, егер ол тауарлық түрі, қасиеттері
            және оны сатып алу шарттарын дәлелдейтін құжаттары сақталған
            жағдайда;
          </li>

          <li>
            Сапалы, жекелеген сипаттамаларға ие тауарды тұтынушы қайтаруға
            құқылы емес, егер ол тауарды тек оны сатып алған адам ғана пайдалана
            алатын болса;
          </li>

          <li>
            Тұтынушы тауардан бас тартқан жағдайда, сатушы тұтынушы төлеген
            қаражатты тұтынушының тиісті талабы ұсынылған күннен бастап он
            күннен кешіктірмей қайтаруға міндетті.
          </li>
        </ol>

        <p>
          Қаражатты банктік картаға қайтару үшін сатып алушы, компания
          электронды поштаға жіберетін “Қаражатты қайтару туралы өтінішті”
          толтыруы керек, және оған қосымша ретінде жеке басын куәландыратын
          куәлік көшірмесін салып, кері электрондық поштаға
          <b class="text-corp"
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >
          жолдауы қажет.
        </p>
        <p>
          Қаражатты қайтару «Қаражатты қайтару туралы өтінішті» Компания алған
          күннен бастап 7 жұмыс күні ішінде банктік картаға жүзеге асырылады.
        </p>
        <p>
          Қателікпен жүргізілген операциялар бойынша қаражатты қайтару үшін жеке
          басты куәландыратын құжаттың көшірмесі мен қате шегерімді растайтын
          түбіртектер/чектерді қоса тіркеп, жазбаша өтінішпен электронды пошта
          <b class="text-corp"
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >
          адресі бойынша жүгіну қажет.
        </p>
        <p>
          Қайтару сомасы сатып алынған сомаға тең болады. Қайтару мерзімі
          компания өтінішті алған сәттен бастап есептеледі (мейрамдар мен
          демалыс күндері есептелмейді).
        </p>

        <ul class="pl-10 mb-4">
          <li>
            банктік карта интернет арқылы төлем жасауға арналмаған. Бұл туралы
            өзіңіздің эмитент банкіңізге хабарласу арқылы білуге болады;
          </li>
          <li>
            банктік картада төлем жасауға жеткілікті қаражат жоқ. Төлем
            картасындағы қаражаттың бар-жоғы туралы толығырақ ақпаратты картаны
            шығарған банкке хабарласу арқылы біле аласыз;
          </li>
          <li>банктік карта деректері қате енгізілген;</li>
          <li>
            банктік картаның жарамдылық мерзімі өтіп кеткен. Картаның жарамдылық
            мерзімі, әдетте, картаның алдыңғы бетінде көрсетіледі (бұл — карта
            жарамды болатын ай мен жыл). Картаның жарамдылық мерзімі туралы
            толығырақ ақпаратты өзіңіздің эмитент банкіңізден біле аласыз.
          </li>
        </ul>

        <p>
          Банктік картамен төлем жасауға және сайт жұмысына қатысты басқа да
          сұрақтар бойынша келесі телефон нөмірлері арқылы хабарласа аласыз:
          <b
            ><a :href="'tel:' + $contacts.phone" class="text-nowrap">{{
              $contacts.phone_format
            }}</a></b
          >
        </p>
      </div>
    </div>
  </div>
</template>
<script setup>
const { t, localeProperties } = useI18n();
useHead({
  title: t("pages.refund-policy.title"),
  meta: [{ name: "description", content: "My amazing site." }],
});
</script>
