<template>
  <div class="custom-grid">
    <div class="col-span-12 text-justify hyphens-auto">
      <div v-if="localeProperties.code === 'ru'">
        <h3 class="text-center">
          ПУБЛИЧНЫЙ ДОГОВОР-ОФЕРТА<br />
          на оказание платных образовательных услуг в онлайн платформе "{{
            $contacts.name
          }}"
        </h3>

        <p>
          Настоящий договор в соответствии с пунктом 5 статьи 395 и со ст. 447
          Гражданского кодекса Республики Казахстан (далее – ГК РК) является
          официальным предложением адресованным юридическому /физическому лицу
          (публичной офертой) от онлайн платформы
          <b>"{{ $contacts.name }}"</b> в лице
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b> БИН
          <b>{{ $contacts.bin }}</b> и содержит все существенные условия по
          оказанию образовательных услуг.
        </p>

        <p>
          В соответствии со статьей 396 ГК, в случае принятия изложенных ниже
          условий и оплаты услуг, физическое лицо, производящее акцепт настоящей
          оферты, становится Заказчиком, а
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b> -
          Исполнителем,  совместно — Сторонами настоящего договора.
        </p>

        <h4 class="text-center">Общие положения</h4>

        <p class="text-center font-medium mt-6">1. Термины и определения</p>

        <p>
          1.1 <b>Договор Оферты</b> – договор заключаемый между Заказчиком и
          Исполнителем, на предоставление образовательных услуг онлайн платформы
          изучения языков, информационно - консультационных услуг, который
          заключается посредством акцепта Оферты.
        </p>
        <p>
          1.2 <b>Акцепт Оферты</b> – полное и безвозвратное принятие Оферты
          методом выполнения действий, указанных в части 4 данной Оферты.
        </p>
        <p>
          1.3 <b>Заказчик</b> – любое юридическое/физическое лицо осуществившее
          акцепт Оферты (принявшее), и становящееся таким образом Заказчиком
          услуг Исполнителя по заключенному данному договору.
        </p>

        <p class="text-center font-medium mt-6">2. Предмет договора Оферты</p>

        <p>
          2.1. Предметом договора Оферты является предоставление Заказчику
          доступа к онлайн платформе изучения иностранных языков и
          образовательных услуг в соответствии с условиями настоящего Договора и
          прейскурантом указанному на сайте Исполнителя.
        </p>
        <p>
          2.2. Публичный договор Оферты является официальным документом и
          предоставляется клиенту либо нарочно либо через WhatsApp/Telegram, а
          также посредством электронной почты по запросу клиента.
        </p>
        <p>
          2.3. После полной оплаты доступа к онлайн платформе Заказчиком,
          Исполнитель в течении 5 рабочих дней предоставляет логин и пароль
          Заказчику путем уведомления через WhatsApp/Telegram (далее –
          мессенджеры), а также посредством электронной почты, при этом Заказчик
          обязан самостоятельно и заблаговременно проверять получение
          уведомления, исходящее от Исполнителя. Дата и время начала занятий
          начинаются на следующий день после предоставления логина и пароля.
        </p>

        <p class="text-center font-medium mt-6">
          3. Акцепт Оферты и заключение договора Оферты
        </p>
        <p>
          Заключение Заказчиком настоящего Договора осуществляется путем
          совершения следующих действий:
        </p>
        <p>
          3.1. Оплатой Заказчик полностью соглашается и безоговорочно принимает
          условия настоящего договора в полном объеме без исключений (акцепт).
        </p>
        <p>
          3.2. Настоящий Договор считается заключенным и вступает в силу для
          Сторон с даты оплаты услуг Заказчиком.
        </p>
        <p>
          3.3. Настоящая публичная оферта определяет все существенные условия
          договора между
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b> и лицом,
          акцептовавшим Оферту.
        </p>

        <p class="text-center font-medium mt-6">
          4. Условия и порядок предоставления услуг
        </p>

        <p>
          4.1. Ознакомившись с перечнем услуг, размещенным на сайте Исполнителя
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          >, выбрав вид пакета/услуги, Заказчик должен оставить Заявку в
          мессенджере WhatsApp
          <b
            ><a :href="'tel:' + $contacts.phone" class="text-nowrap">{{
              $contacts.phone_format
            }}</a></b
          >, либо созвонившись с представителями по указанному номеру.
          Телефонные разговоры представителей Исполнителя с Заказчиком могут
          быть записаны.
        </p>

        <p>
          4.2. Для оформления Заявки Заказчик обязан предоставить следующие
          данные:
        </p>

        <ol class="pl-10 mb-4">
          <li>ФИО;</li>
          <li>Контактный номер WhatsApp;</li>
          <li>Контактный e-mail;</li>
          <li>
            Посредством заполнения анкетных данных на сайте
            <b
              ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
            >.
          </li>
        </ol>

        <p>
          4.3. Заказчик оплачивает услуги по настоящему Договору полностью в
          размере, установленном Исполнителем.
        </p>

        <p>
          4.4. Акцептуя условия Оферты, Заказчик дает согласие в соответствии с
          действующим законодательством на обработку (далее обработка ПД)
          Исполнителем предоставленной им информации и (или) его персональных
          данных. Обработка персональных данных совершается с использованием
          средств автоматизации или без использования таких средств с
          персональными данными, включая сбор, запись систематизацию,
          накопление, хранение, уточнение (обновление, изменение), извлечение,
          использование, обезличивание, блокирование, удаление, уничтожение
          персональных данных с целью выполнения Исполнителем своих обязательств
          принятых по условиям настоящего Договора, иных обязательств,
          предусмотренных Договором, а также с целью выполнения требований
          нормативных актов по противодействию легализации денежных средств,
          полученных преступным путем и иных нормативных актов. Срок
          использования предоставленных Заказчиком персональных данных –
          бессрочно. Заказчик также дает свое согласие на обработку и
          использование Исполнителем предоставленной им информации и (или) его
          персональных данных с целью осуществления по указанному Заказчиком
          контактному телефону и (или) контактному электронному адресу
          информационной рассылки (о мероприятиях Исполнителя) или рекламной
          рассылки об услугах Исполнителя или партнера Исполнителя.
        </p>

        <p class="text-center font-medium mt-6">
          5. Стоимость услуг и порядок расчетов по договору Оферты
        </p>

        <p>
          5.1. Оплата производится безналичным способом, путем перечисления
          денежных средств Заказчиком на расчетный счет Исполнителя.
        </p>

        <p>
          5.2. Оплата за доступ на платформу для юридического лица (товарищества
          с ограниченной ответственностью и т.д. и индивидуальных
          предпринимателей) за курс производится в 100% размере на ежемесячной
          или ежегодной основе.
        </p>

        <p>
          5.3. Датой оплаты считается дата поступления денежных средств на счет
          Исполнителя.
        </p>

        <p>
          5.4. Заказчик самостоятельно отслеживает изменение реквизитов
          Исполнителя, указанных в настоящем Договоре и несет ответственность за
          правильность производимых им платежей.
        </p>

        <p>5.5. Стоимость услуг публикуются на сайте Исполнителя.</p>

        <p>
          5.6. Оплата услуг производится в казахстанских тенге. Услуги
          Исполнителя не облагаются НДС.
        </p>

        <p class="text-center font-medium mt-6">
          6. Обязанности и права исполнителя
        </p>

        <p>6.1. Исполнитель обязуется:</p>

        <p>
          6.1.1. Обеспечить качественное оказание услуг онлайн платформы по
          изучению иностранных языков, выбранным Заказчиком, после своевременной
          оплаты услуг на условиях настоящего Договора.Обеспечить качественный
          доступ к образовательной платформе, в соответствии с учебным планом и
          тарифом, выбранным Заказчиком, после своевременной оплаты услуг на
          условиях настоящего Договора.
        </p>

        <p>
          6.1.2. Сохранять конфиденциальность информации Заказчика, за
          исключением случаев, предусмотренных действующим законодательством
          Республики Казахстан.
        </p>

        <p>6.2. Исполнитель вправе:</p>

        <p>
          6.2.1. Изменять даты и время проведения услуг, а также иные учебные
          аспекты не касающиеся стоимости на период принятия оферты. Исполнитель
          уведомляет Заказчика об указанных изменениях путем размещения
          информации на сайте Исполнителя, либо посредством звонков и рассылок в
          мессенджерах.
        </p>

        <p>
          6.2.2. Разрабатывать и видоизменять программу курса, определять
          количество и состав вступающих на курс, а так же место проведения.
        </p>

        <p>6.2.3. Оказывать услуги с привлечением сторонних специалистов.</p>

        <p>
          6.2.4. Проводить фото- и видеосъемку во время проведения мероприятия и
          использовать полученные при фото - и видеосъемке материалы по своему
          усмотрению. Исполнителю принадлежит исключительное авторское право, а
          также смежные с авторским правом права на указанные материалы,
          использование полученных при фото - и видеосъемке материалов в
          коммерческих целях возможно только с письменного разрешения
          Исполнителя.
        </p>

        <p>
          6.3. Отказать в предоставлении услуг, если Заказчик в период
          пользования платформой допускал нарушения, предусмотренные Гражданским
          законодательством и настоящим договором, и дающие Исполнителю право в
          одностороннем порядке отказаться от исполнения договора.
        </p>

        <p>
          6.4. Исполнитель имеет право незамедлительно прекратить оказание услуг
          платформы по образовательным услугам через онлайн платформу в случае
          проявления со стороны Заказчика агрессии или неуважительного
          отношения.
        </p>

        <p class="text-center font-medium mt-6">
          7. Обязанности и права заказчика
        </p>

        <p>7.1. Заказчик обязуется:</p>

        <p>
          7.1.1. Самостоятельно и своевременно знакомиться с датами доступа и
          оплат производимых при использовании онлайн платформы до момента
          подачи Заявки, а также с изменениями указанных условий, с актуальной
          редакцией Договора при каждом посещении Сайта. После акцепта Оферты.
        </p>

        <p>
          7.1.2. Оформляя Заявку на оказание услуг Исполнителем заполнить
          необходимые обязательные поля в Заявке с указанием выбранного доступа
          и достоверной информации.
        </p>

        <p>
          7.1.3. Незамедлительно уведомить Исполнителя об изменении своих
          контактных данных в письменной форме посредством e-mail или в
          мессенджерах "WhatsApp", "Telegram".
        </p>

        <p>7.2. Заказчик вправе:</p>

        <p>
          7.2.1. Получать услуги в соответствии с условиями настоящей Оферты.
        </p>

        <p>
          7.2.2. Заказчик вправе направлять Исполнителю свои мнения, предложения
          и рекомендации по каждому виду Услуг по настоящей Оферте.
        </p>

        <p>
          7.2.3. Заказчик вправе обращаться к Исполнителю при возникновении
          вопросов по проходящему курсу, а Исполнитель обязуется в полной мере
          ответить на возникшие вопросы Заказчика.
        </p>

        <p class="text-center font-medium mt-6">8. Ответственность сторон</p>

        <p>
          8.1. В случаях неисполнения или ненадлежащего исполнения своих
          обязательств по Договору, Стороны несут ответственность в соответствии
          с законодательством РК с учетом условий Договора.
        </p>

        <p>
          8.2. Исполнитель не несет ответственности в случае ненадлежащего
          оказания услуги, если ненадлежащее исполнение явилось следствием
          недостоверности, недостаточности или несвоевременности предоставленных
          Заказчиком сведений, а также вследствие других нарушений условий
          настоящего Договора со стороны Заказчика.
        </p>

        <p>
          8.3. Исполнитель не несет ответственности за несоответствие
          предоставленной услуги ожиданиям Заказчика и/или за его субъективную
          оценку, такое несоответствие ожиданиям и/или отрицательная
          субъективная оценка не являются основаниями считать услуги оказанными
          не качественно, или не в согласованном объеме.
        </p>

        <p>
          8.4. Исполнитель не несет ответственности за невозможность
          обслуживания Заказчика по каким- либо независящим от него причинам,
          включая нарушение работы интернета, транспортных средств, заболевания,
          отъезды и иные причины. За несостоявшиеся по вине Заказчика услуги,
          деньги, внесенные им в качестве оплаты, не возвращаются.
        </p>

        <p>
          8.5. Исполнитель не несет ответственности за вред, причиненный
          деятельности Заказчика или лиц, которых он представляет, в случае
          ненадлежащего исполнения им обязательств по настоящему договору,
          нарушения требований сотрудников Исполнителя.
        </p>

        <p>
          8.6. Оплачивая услуги Исполнителя по договору Оферты, заказчик
          соглашается с условиями данного договора и с тем, что он не в праве
          требовать от Исполнителя какой-либо компенсации морального,
          материального вреда или вреда, причиненного Заказчику как в течение
          срока действия настоящего Договора, так и по истечении срока его
          действия, за исключением случаев, прямо предусмотренных действующим
          законодательством.
        </p>

        <p>
          8.7. Заказчик обязуется указывать достоверные данные при оформлении
          Заявки.
        </p>

        <p>
          8.8. В случаях, если Заказчик, по причинам, не зависящим от
          Исполнителя, не пользовался онлайн платформой для изучения иностранных
          языков и не уведомил исполнителя о своем желании отказаться от
          предоставления услуг в сроки предусмотренные законодательством, или
          уведомил после дня предоставления онлайн доступа на онлайн платформу
          изучения иностранных языков, то услуга считается оказанной надлежащим
          образом и оплаченные Исполнителю денежные средства возврату не
          подлежат.
        </p>

        <p>
          8.9. Заказчик несет ответственность за порчу оборудования и имущества
          Исполнителя.
        </p>

        <p>
          8.10. Совокупная ответственность Исполнителя по договору Оферты, по
          любому иску или претензии в отношении договора Оферты или его
          исполнения, ограничивается 100% (ста процентами) от суммы платежа,
          уплаченного Исполнителю Заказчиком по договору Оферты.
        </p>

        <p>
          8.11. Не вступая в противоречие с указанным выше, Исполнитель
          освобождается от ответственности за нарушение условий договора Оферты,
          если такое нарушение вызвано действием обстоятельств непреодолимой
          силы (форс-мажор), включая: действия органов государственной власти,
          пожар, наводнение, землетрясение, другие стихийные действия,
          отсутствие электроэнергии, забастовки, гражданские волнения,
          беспорядки, любые иные обстоятельства, не ограничиваясь перечисленным,
          которые могут повлиять на выполнение Исполнителем договора Оферты.
        </p>

        <p>
          8.12. Договор Оферты, его заключение и исполнение регулируется в
          соответствии с действующим законодательством Республики Казахстан.
        </p>

        <p>
          8.13. Согласно настоящему договору Оферты не допускается
          использование, распространение, копирование и/или извлечение любых
          материалов или информации (включая тексты описаний, фотографии,
          видеоматериалы и прочее) используемые во время обучения на онлайн
          платформе и любых на курсах представленных на платформе, а так же
          размещенные на Сайте Исполнителя и переданные Исполнителем Заказчику.
          Размещенные на сайте материалы охраняются действующим
          законодательством РК об авторском праве и смежных с ним прав. При
          разрешении всех споров по настоящему договору Оферты применяется
          действующее законодательство Республики Казахстан.
        </p>

        <p class="text-center font-medium mt-6">
          9. Результат интеллектуальной деятельности
        </p>

        <p>
          9.1. Все информационные материалы, предоставляемые Исполнителем
          Заказчику в процессе проведения курсов/тренингов на онлайн платформе,
          а также результаты фото- и видеосъемки, полученные Исполнителем во
          время проведения курсов/тренингов на онлайн платформе, являются
          результатом интеллектуальной деятельности, исключительное авторское
          право, в том числе смежные с авторским права принадлежит Исполнителю.
        </p>

        <p>
          9.2. Осуществлять фотосъемку, аудио и/или видеозапись курсов изучаемых
          через онлайн платформу <b>"{{ $contacts.url }}"</b> возможно только с
          разрешения Исполнителя. Использование результатов интеллектуальной
          деятельности исполнителя является нарушением исключительного права
          Исполнителя, что влечет за собой гражданскую, административную и иную
          ответственность в соответствии с действующим законодательством РК.
        </p>

        <p>
          9.3. Также Заказчик не имеет права копировать аудио и видеоматериалы
          курсов/тренингов Исполнителя, транслируемых онлайн, полностью или
          частично, вести запись трансляций курсов/тренингов, а также
          фиксировать содержание таких курсов/тренингов полностью или частично
          каким-либо способом и/или на какой-либо материальный носитель, а также
          использовать содержание указанных курсов/тренингов без письменного
          согласия Исполнителя, что будет считаться нарушением исключительного
          права Исполнителя и влечет за собой гражданскую, административную и
          иную ответственность в соответствии с действующим законодательством
          РК.
        </p>

        <p class="text-center font-medium mt-6">10. Разрешение споров</p>

        <p>
          10.1. В случае ненадлежащего исполнения Договора одной из сторон,
          повлекшего неблагоприятные последствия для другой стороны,
          ответственность наступает согласно действующему законодательству РК.
        </p>

        <p>
          10.2. Все споры и разногласия решаются путем переговоров Сторон. В
          случае если споры и разногласия не могут быть урегулированы путем
          переговоров, они передаются на рассмотрение по месту нахождения
          Исполнителя.
        </p>

        <p class="text-center font-medium mt-6">
          11. Срок действия, пролонгация, изменение, расторжение договора Оферты
        </p>

        <p>
          11.1. Настоящий Договор вступает в силу с момента акцепта Заказчиком
          данной Публичной оферты и действует до полного исполнения Сторонами
          взятых на себя обязательств.
        </p>

        <p>
          11.2. Исполнитель оставляет за собой право внести изменения в условия
          Оферты. В случае внесения Исполнителем изменений в Оферту, такие
          изменения вступают в силу с момента их опубликования на сайте
          Исполнителя.
        </p>

        <p>
          11.3. Заказчик соглашается и признает, что внесение изменений в Оферту
          влечет за собой внесение этих изменений в заключенный и действующий
          между Заказчиком и Исполнителем Договор, и эти изменения в Договор
          вступают в силу одновременно с вступлением в силу таких изменений в
          Оферту.
        </p>

        <p>
          11.4. Возврат денежных средств после предоставления Заказчику доступа
          к материалам Услуг не осуществляется, за исключением случая,
          предусмотренного п. 11.5. Договора.
        </p>

        <p>
          11.5. Заказчик вправе потребовать от Исполнителя вернуть оплаченные
          денежные средства в течение 3 календарных дней с момента
          предоставления Заказчику доступа к материалам Услуг, в порядке,
          предусмотренном в п. 11.6 настоящего Договора, при условии просмотра
          Заказчиком не более двух Контентных уроков. В случае соблюдения
          Заказчиком условий возврата, указанных в настоящем пункте Договора,
          Исполнитель в течение 10 календарных дней осуществляет 100 % возврат
          денежных средств, уплаченных Заказчиком к моменту возврата.
        </p>

        <p>
          11.6. В случае отказа Заказчика от Договора и наличии у него права на
          возврат денежных средств, Исполнитель направляет Заказчику форму
          заявления о возврате денежных средств (далее - Заявление). Заказчик не
          позднее 5 (пяти) рабочих дней с момента получения формы Заявления от
          Исполнителя обязуется корректно заполнить, подписать и направить ее
          Исполнителю в сканированном виде на электронный адрес заказчика.
        </p>

        <p>
          11.7. В случае оплаты в Кредит\рассрочку через АО «Kaspi Bank» и
          отказа Заказчика от Договора Исполнитель возвращает Заказчику только
          свое Вознаграждение и не возмещает проценты\расходы, понесенные
          Исполнителем при заключении договора с Банком-партнером.
        </p>

        <p>
          11.8. Стороны считают обучение законченным, если Заказчику был
          предоставлен доступ к материалам курса, Заказчик выполнял задания и
          получал преподавательскую поддержку в соответствии с выбранным тарифом
          и получил электронный сертификат с подтверждением об окончании курса.
        </p>

        <p>
          11.9. Стандарт пакеты: для юридических и физических лиц представлены
          на сайте.
        </p>

        <p class="text-center font-medium mt-6">12. Конфиденциальность</p>

        <p>
          12.1. Стороны обязуются без обоюдного согласия не передавать третьим
          лицам, либо использовать иным способом, не предусмотренным условиям
          договора, организационно-технологическую, коммерческую, финансовую и
          иную информацию, составляющую коммерческую тайну для любой из Сторон
          при условии, что:
        </p>

        <ul class="pl-10 mb-4">
          <li>
            такая информация имеет действительную или потенциальную коммерческую
            ценность в силу ее неизвестности третьим лицам;
          </li>

          <li>
            к такой информации нет свободного доступа на законном основании;
          </li>

          <li>
            обладатель такой информации принимает надлежащие меры к обеспечению
            ее конфиденциальности.
          </li>
        </ul>

        <p>
          12.2. Срок охраны конфиденциальной информации устанавливается
          Сторонами не менее одного года со дня окончания действия договора
          Оферты.
        </p>

        <p class="text-center font-medium mt-6">13. Прочие условия</p>

        <p>
          13.1. Настоящий Договор действует до момента исполнения Сторонами всех
          обязательств. Все приложения являются неотъемлемой частью к настоящему
          Договору.
        </p>

        <p>
          13.2. Договор Оферты представляет собой полную договоренность между
          Исполнителем и Заказчиком. Исполнитель не принимает на себя никаких
          условий и обязательств в отношении предмета Оферты, за исключением
          указанных в Оферте, которыми регулируется исполнение договора Оферты,
          за исключением случая, когда такие условия или обязательства
          зафиксированы в письменном виде и подписаны уполномоченными
          представителями Исполнителя и Заказчика. В случае если какие-либо
          условия Приложений или Дополнительных Соглашений к договору Оферты
          противоречат условиям Оферты, положения Оферты будут преобладать.
        </p>

        <p>
          13.3. Заказчик заключает договор Оферты добровольно, при этом
          Заказчик:
        </p>

        <ul class="pl-10 mb-4">
          <li>ознакомился с условиями Оферты;</li>

          <li>полностью понимает предмет Оферты и договора Оферты;</li>

          <li>
            полностью понимает значение и последствия своих действия в отношении
            заключения и исполнения договора Оферты.
          </li>
        </ul>

        <p>
          13.4. Заказчик обладает всеми правами и полномочиями, необходимыми для
          заключения исполнения Договора Оферты.
        </p>

        <p>
          13.5. Если какое-либо из условий Оферты признано недействительным или
          незаконным, или не может вступить в силу в соответствии с действующим
          законодательством РК, такое удаляется из Оферты и заменяется новым
          положением, максимально отвечающим изначальным намерениям,
          содержащимся в Оферте, при этом остальные положения Оферты (договора
          Оферты) не меняются и остаются в силе.
        </p>

        <p>
          13.6. Во всем остальном, что не предусмотрено настоящим Договором,
          Стороны будут руководствоваться действующим законодательством РК.
        </p>

        <p>
          Заказчик подтверждает, что все условия настоящего Договора ему ясны, и
          он принимает их безусловно и в полном объеме.В случае претензий или
          несогласия с пунктами, Заказчик должен уведомить Исполнителя в
          письменном виде о желаемых индивидуальных условиях по электронному
          адресу
          <b class="text-corp"
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >.
        </p>

        <p class="text-center font-medium mt-6">14. Реквизиты Исполнителя</p>

        <p>
          Юридическое лицо:
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b>
        </p>
        <p>
          БИН: <b>{{ $contacts.bin }}</b>
        </p>

        <p>
          Юридический адрес:
          <b>{{ $contacts.legal_address[localeProperties.code] }}</b>
        </p>

        <p>
          Фактический адрес:
          <b>{{ $contacts.fact_address[localeProperties.code] }}</b>
        </p>

        <p>
          Банковские реквизиты:
          <b>{{ $contacts.bank.name[localeProperties.code] }}</b>
        </p>

        <p>
          БИК: <b>{{ $contacts.bank.bik }}</b>
        </p>

        <p>
          ИИК: <b>{{ $contacts.bank.iik }}</b>
        </p>

        <p>
          Директор: <b>{{ $contacts.founder }}</b>
        </p>
      </div>

      <div v-else-if="localeProperties.code === 'kk'">
        <h3 class="text-center">
          "{{ $contacts.name }}" онлайн платформа арқылы білім беру қызметтерін
          көрсетуге<br />
          АШЫҚ ҰСЫНЫС КЕЛІСІМШАРТЫ
        </h3>

        <p>
          Осы келісім Қазақстан Республикасының Азаматтық кодексінің (бұдан әрі
          – ҚР АК) 395-бабының 5-тармағына және 447-баптарына сәйкес
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b> ұсынатын
          <b>"{{ $contacts.name }}"</b> онлайн мектебінен заңды/жеке тұлғаға
          жіберілген ресми ұсыныс (ашық ұсыныс) болып табылады және білім беру
          қызметтерін көрсету үшін барлық қажетті жағдайларды қамтиды.
        </p>

        <p>
          АК 396-бабына сәйкес, төменде көрсетілген шарттарды қабылдаған және
          қызметтерге ақы төлеген жағдайда, осы ұсынысты қабылдаған жеке тұлға
          Тапсырыс беруші, ал
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b
          >, БСН <b>{{ $contacts.bin }}</b> – Орындаушы, бірлесіп – осы
          келісім-шарттың – Тараптары болып табылады.
        </p>

        <h4 class="text-center">Жалпы ережелер</h4>

        <p class="text-center font-medium mt-6">1. Терминдер мен анықтамалар</p>

        <p>
          1.1. <b>Ұсыныс келісім-шарты</b> – Тапсырыс беруші мен Орындаушы
          арасында тіл үйренудің онлайн платформасының қызметтерін білім беру,
          ақпараттық және кеңес беру қызметтерін көрсетуге жасалған шарт.
        </p>

        <p>
          1.2. <b>Ұсыныстың акцепті</b> – осы Офертаның 4-бөлігінде көрсетілген
          әрекеттерді орындау арқылы Ұсынысты толық және кері қайтарып алусыз
          қабылдау.
        </p>

        <p>
          1.3. <b>Тапсырыс беруші</b> – Ұсыныс акцептің орындаған (қабылданған)
          және осылайша осы келісім-шарт бойынша Орындаушы қызметтерінің
          Тұтынушысына айналған кез келген заң/жеке тұлға.
        </p>

        <p class="text-center font-medium mt-6">
          2. Ұсыныс келісім-шартының мәні
        </p>

        <p>
          2.1. Ұсыныс келісім-шартының мәні осы Шарттың талаптарына және
          Орындаушының веб-сайтында көрсетілген бағалар тізіміне сәйкес шет
          тілдерін және білім беру қызметтерін үйренуге арналған онлайн
          платформаға қол жеткізуді қамтамасыз ету болып табылады.
        </p>

        <p>
          2.2. Ашық ұсыныс келісім-шарты ресми құжат болып табылады және
          клиентке жеке өзі немесе WhatsApp/Telegram сонымен қатар клиенттің
          сұрауы бойынша электрондық пошта арқылы беріледі.
        </p>

        <p>
          2.3. Тапсырыс беруші онлайн платформаға кіруге толық ақы төлегеннен
          кейін Орындаушы 5 жұмыс күні ішінде Тапсырыс берушіге
          WhatsApp/Telegram арқылы (бұдан әрі - мессенджерлер), сондай-ақ
          электрондық пошта арқылы хабарлама арқылы логин мен парольді ұсынады,
          бұл ретте Тапсырыс беруші Орындаушыдан шығатын хабарламаны алуды
          дербес және алдын ала тексеруге міндетті. Сабақтың басталу күні мен
          уақыты логин мен парольді ұсынғаннан кейін келесі күні басталады.
        </p>

        <p class="text-center font-medium mt-6">
          3. Ұсынысты қабылдау және Ұсыныс шартын жасау
        </p>
        <p>
          Тапсырыс берушінің осы Келісім-шартты жасасуы келесі әрекеттерді
          орындау арқылы жүзеге асырылады:
        </p>

        <p>
          3.1. Төлей отырып, Тапсырыс беруші осы келісім-шарттың талаптарымен
          толығымен келіседі және сөзсіз, ешбір ерекшеліктер еңгізбей қабылдайды
          (акцепт).
        </p>
        <p>
          3.2. Осы Келісім-шарт Тапсырыс беруші қызметтерге ақы төлеген күннен
          бастап Тараптар үшін жасалған болып саналады және күшіне енеді.
        </p>
        <p>
          3.3. Бұл ашық ұсыныс (оферта)
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b> пен Ұсынысты
          қабылдаған жеке тұлға арасындағы шарттың барлық маңызды талаптарын
          анықтайды.
        </p>

        <p class="text-center font-medium mt-6">
          4. Қызмет көрсетудің шарттары мен тәртібі
        </p>

        <p>
          4.1. Тапсырыс беруші Орындаушының
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          >, веб-сайтында орналастырылған қызметтер тізбесімен танысып,
          пакет/қызмет түрін таңдағаннан кейін,
          <b
            ><a :href="'tel:' + $contacts.phone" class="text-nowrap">{{
              $contacts.phone_format
            }}</a></b
          >
          WhatsApp мессенджерінде немесе осы нөмер бойынша хабарласып Өтінім
          қалдыруы керек. Орындаушы өкілдері мен Тапсырыс беруші арасындағы
          телефон арқылы сөйлесулер жазылуы мүмкін.
        </p>

        <p>
          4.2. Өтінімді толтыру үшін Тапсырыс беруші келесі деректерді беруге
          міндетті:
        </p>

        <ol class="pl-10 mb-4">
          <li>Толық аты-жөні;</li>
          <li>WhatsApp байланыс нөмірі;</li>
          <li>Байланыс электрондық поштасы;</li>
          <li>
            Сауалнама деректерін
            <b
              ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
            >
            сайтында толтыру арқылы
          </li>
        </ol>

        <p>
          4.3. Келісім-шарт бойынша Тапсырыс беруші қызметтерді Орындаушы
          белгілеген мөлшерде толық көлемде төлейді.
        </p>
        <p>
          4.4. Ұсыныс шарттарын қабылдай отырып, Тапсырыс беруші қолданыстағы
          заңнамаға сәйкес өзі ұсынған ақпаратты және (немесе) оның жеке
          деректерін (бұдан әрі ЖД өңдеу) Орындаушының өңдеуіне келіседі. Жеке
          деректерді өңдеу автоматтандыру құралдарын пайдалана отырып немесе
          жеке деректерге мұндай құралдарды пайдаланбай, соның ішінде жеке
          деректерді жинауды, жазуды, жүйелеуді, жинақтауды, сақтауды,
          нақтылауды (жаңартуды, өзгертуді), алуды, пайдалануды, иеліктен
          шығаруды, блоктауды, жоюды Орындаушы осы Келісім-шарттың талаптарына
          сәйкес өзіне алған міндеттемелерін жүзеге асыру мақсатында,
          Келісім-шартта көзделген басқа да міндеттемелерді орындау мақсатында,
          сондай-ақ қылмыстық жолмен алынған кірістерді заңдастыруға қарсы күрес
          жөніндегі нормативтік құқықтық актілердің талаптарын орындау
          мақсатында жүзеге асырылады. Тапсырыс беруші берген жеке деректерді
          пайдалану мерзімінің шегі жоқ болып табылады. Тапсырыс беруші сонымен
          қатар өзі ұсынған ақпаратты және (немесе) өзінің жеке деректерін,
          Орындаушыға көрсеткен байланыс телефон нөміріне және (немесе) байланыс
          электрондық пошта мекенжайына Орындаушының немесе Орындаушының
          серіктесінің қызметтері туралы ақпараттық хабарламаларды (Орындаушының
          іс-шаралары туралы) немесе жарнамалық хабарламаларды жіберу мақсатында
          қолдануға келсім береді.
        </p>

        <p class="text-center font-medium mt-6">
          5. Қызметтердің құны және Ұсыныс келісім-шарты бойынша есеп айырысу
          тәртібі
        </p>

        <p>
          5.1. Төлем қолма-қол ақшамен немесе банктік аударыммен, Тапсырыс
          берушінің Орындаушының шотына ақша аудару арқылы жүзеге асырылады.
        </p>
        <p>
          5.2. бағам үшін заңды тұлға (жауапкершілігі шектеулі серіктестік және
          т.б. және жеке кәсіпкерлер) үшін платформаға қол жеткізу үшін төлем ай
          сайынғы немесе жыл сайынғы негізде 100% мөлшерде жүргізіледі.
        </p>
        <p>
          5.3. Төлем күні болып Орындаушының шотына қаражат түскен күн саналады.
        </p>
        <p>
          5.4. Тапсырыс беруші осы Келісім-шартта көрсетілген Орындаушының
          деректемелерінің(есеп-шотының) өзгеруін дербес қадағалайды және ол
          төлеген төлемдердің дұрыстығына жауап береді.
        </p>
        <p>5.5. Қызметтердің құны Орындаушының веб-сайтында жарияланады.</p>
        <p>
          5.6. Қызметтер үшін төлем қазақстандық теңгемен жүзеге асырылады.
          Орындаушының қызметтеріне ҚҚС салынбайды.
        </p>

        <p class="text-center font-medium mt-6">
          6. Орындаушының міндеттері мен құқықтары
        </p>
        <p>6.1. Орындаушы міндеттелінеді:</p>

        <p>
          6.1.1. Осы Шарттың талаптары бойынша қызметтерге уақытылы ақы
          төлегеннен кейін Тапсырыс беруші таңдаған шет тілдерін үйренуге
          арналған онлайн-платформаның қызметтерін сапалы көрсетуді қамтамасыз
          ету. Осы Шарттың талаптары бойынша қызметтерге уақытылы төлем
          жасағаннан кейін Тапсырыс беруші таңдаған оқу жоспары мен тарифіне
          сәйкес білім беру платформасына жоғары сапалы қолжетімділікті
          қамтамасыз ету.
        </p>

        <p>
          6.1.2. Қазақстан Республикасының қолданыстағы заңнамасында көзделген
          жағдайларды қоспағанда, Тапсырыс беруші ақпаратының құпиялылығын
          сақтау.
        </p>

        <p>6.2. Орындаушының құқығы бар:</p>

        <p>
          6.2.1. Қызметтердің күні мен уақытын, сондай-ақ ұсынысты қабылдау
          кезеңіндегі құнына қатысы жоқ басқа білім беру аспектілерін өзгерту.
          Орындаушы бұл өзгерістер туралы Тапсырыс берушіні Орындаушының
          веб-сайтында ақпаратты орналастыру арқылы немесе жедел қоңыраулар мен
          хаттар арқылы хабардар етеді.
        </p>

        <p>
          6.2.2. Курс бағдарламасын әзірлеу және өзгерту, курсқа түсетіндердің
          саны мен құрамын, сондай-ақ курстың орналасқан жерін анықтау.
        </p>

        <p>6.2.3. Сырттан мамандарды тарта отырып қызметтерді көрсету.</p>

        <p>
          6.2.4. Іс-шара кезінде фото және бейне түсірілімге түсіру және фото
          және бейне түсірілім кезінде алынған материалдарды өз қалауы бойынша
          пайдалану. Орындаушы көрсетілген материалдарға айрықша авторлық
          құқықты, сондай-ақ авторлық құқықпен сабақтас құқықтарды иеленеді,
          фото және бейне түсіру кезінде алынған материалдарды коммерциялық
          мақсатта пайдалану Орындаушының жазбаша рұқсатымен ғана мүмкін болады.
        </p>

        <p>
          6.3. Егер Тапсырыс беруші платформаны пайдалану кезеңінде Азаматтық
          заңнамада және осы шартта көзделген және Орындаушыға шартты орындаудан
          біржақты тәртіппен бас тарту құқығын беретін бұзушылықтарға жол берсе,
          қызметтер көрсетуден бас тартуға.
        </p>

        <p>
          6.4. Орындаушы Тапсырыс беруші тарапынан агрессия немесе құрметсіздік
          танытқан жағдайда онлайн-платформа арқылы білім беру қызметтеріне
          арналған платформа қызметтерін көрсетуді дереу тоқтатуға құқылы.
        </p>

        <p class="text-center font-medium mt-6">
          7. Тапсырыс берушінің міндеттері мен құқықтары
        </p>
        <p>7.1. Тапсырыс беруші міндеттелінеді:</p>
        <p>
          7.1.1. Өтінім берілген сәтке дейін онлайн платформаны пайдалану
          кезінде жүргізілетін қолжетімділік және ақы төлеу күндерімен,
          сондай-ақ көрсетілген шарттардың өзгерістерімен, Сайтқа әрбір кірген
          кезде Шарттың өзекті редакциясымен дербес және уақтылы танысуға.
          Офертаның акцептінен кейін.
        </p>
        <p>
          7.1.2 Орындаушы қызмет көрсетуге өтінімді ресімдей отырып, таңдалған
          қолжетімділік пен дұрыс ақпаратты көрсете отырып, өтінімдегі қажетті
          міндетті жолдарды толтыруға.
        </p>

        <p>
          7.1.3. Байланыс нөмірі өзгерген жағдайда, өзгергені туралы дереу
          Орындаушыға электрондық пошта немесе WhatsApp, Telegram мессенджерлері
          арқылы жазбаша хабарлау.
        </p>

        <p>7.2. Тапсырыс берушінің құқығы бар:</p>
        <p>7.2.1. Осы Ұсыныстың шарттарына сәйкес қызметтерді алу.</p>
        <p>
          7.2.2. Тапсырыс беруші Орындаушыға осы Ұсыныс шеңберінде Қызметтердің
          әрбір түрі бойынша өз пікірлерін, ұсыныстарын жіберуге құқылы.
        </p>
        <p>
          7.2.3. Оқып жатқан Курсы бойынша сұрақтар туындаған жағдайда Тапсырыс
          беруші Орындаушымен байланысуға құқылы, ал Орындаушы Тапсырыс
          берушінің сұрақтарына толық жауап беруге міндеттелінеді.
        </p>

        <p class="text-center font-medium mt-6">
          8. Тараптардың жауапкершілігі
        </p>
        <p>
          8.1. Келісім-шарт бойынша өз міндеттемелерін орындамаған немесе
          тиісінше орындамаған жағдайда Тараптар Келісім-шарттың талаптарын
          ескере отырып, Қазақстан Республикасының заңнамасына сәйкес жауапты
          болады.
        </p>
        <p>
          8.2. Орындаушы қызметтің тиісінше ұсынылуы үшін жауапты болмайды, егер
          Тапсырыс беруші ұсынған ақпараттың сенімсіздігі, жеткіліксіздігі
          немесе уақтылы болмауы салдарынан тиісінше орындалмау болса, сондай-ақ
          осы Келісім-шарт талаптарының өзге де бұзылуы салдары болса.
        </p>
        <p>
          8.3. Орындаушы көрсетілген қызметтің Тапсырыс берушінің күткеніне
          және/немесе оның субъективті бағасына сәйкес келмеуі үшін жауап
          бермейді, мұндай күтуге сәйкес келмеуі және/немесе теріс субъективті
          бағалау көрсетілген қызметтерді жоғары сапалы емес немесе келісілген
          көлемде емес деп санауға негіз болып табылмайды.
        </p>
        <p>
          8.4. Орындаушы өзінің бақылауынан тыс кез келген себептермен, соның
          ішінде интернет бұзылуы, көлік құралдарының бұзылуы, сырқаттану, кету
          және басқа да себептер бойынша Тапсырыс берушіге қызмет көрсету мүмкін
          емес болғаны үшін жауапты емес. Тапсырыс берушінің кінәсінен
          атқарылмаған қызметтер үшін оның төлем ретінде төлеген ақшасы
          қайтарылмайды.
        </p>
        <p>
          8.5. Тапсырыс беруші осы келісім-шарт бойынша міндеттемелерді тиісінше
          орындамаған жағдайда, Орындаушы қызметкерлерінің талаптарын бұзған
          жағдайда, Тапсырыс берушінің немесе ол өкілдік ететін тұлғалардың
          қызметіне келтірілген зиян үшін Орындаушы жауап бермейді.
        </p>
        <p>
          8.6. Тапсырыс беруші Ұсыныс келісім-шарты бойынша Орындаушының
          қызметтеріне ақы төлей отырып, осы шарттың талаптарымен келіседі және
          ол Орындаушыдан Тапсырыс берушіге Келісім-шарт мерзімі ішінде,
          Келісім-шарттың қолданылу мерзімі аяқталғаннан кейін де келтірілген
          моральдық, материалдық залал немесе залал үшін қандай да бір өтемақы
          талап етуге де құқығы жоқ , қолданыстағы заңнамада тікелей көзделген
          жағдайларды қоспағанда.
        </p>
        <p>
          8.7. Тапсырыс беруші Өтінімді толтыру кезінде сенімді деректерді
          беруге міндеттелінеді.
        </p>
        <p>
          8.8. Тапсырыс беруші Орындаушыға байланысты емес себептермен шет
          тілдерін үйренуге арналған онлайн платформаны пайдаланбаған және
          Орындаушыға заңнамада белгіленген мерзімде қызметтерді көрсетуден бас
          тартуды қалауы туралы хабарламаған немесе шет тілдерін үйренуге
          арналған онлайн-платформаға онлайн қолжетімділікті берген күннен кейін
          хабарламаған жағдайларда, қызмет тиісті түрде көрсетілді және
          Мердігерге қайтарылуға жатпайды.
        </p>
        <p>
          8.9. Тапсырыс беруші Орындаушының жабдықтары мен мүлкінің бүлінуі үшін
          жауапты болады.
        </p>
        <p>
          8.10. Ұсыныс келсім-шарты бойынша Орындаушының Ұсыныс шартына немесе
          оны орындауға қатысты кез келген шағым немесе талап үшін жалпы
          жауапкершілігі Тапсырыс берушінің Орындаушыға төлеген төлем сомасының
          100% (жүз пайызы) шегінде шектеледі.
        </p>
        <p>
          8.11. Жоғарыда айтылғандарға қайшы келмей, Орындаушы Ұсыныс
          келісім-шартының талаптарын бұзғаны үшін жауапкершіліктен босатылады,
          егер мұндай бұзушылық форс-мажорлық жағдайлардан туындаса, оның
          ішінде: мемлекеттік органдардың әрекеттері, өрт, су тасқыны, жер
          сілкінісі, басқа стихиялық әрекеттер, электр энергиясының болмауы,
          ереуілдер, азаматтық толқулар, тәртіпсіздіктер, Орындаушының Ұсыныс
          келісімін орындауына әсер етуі мүмкін жоғарыда аталғандармен
          шектелмейтін кез келген басқа да форс-мажорлық жағдайлар.
        </p>
        <p>
          8.12. Ұсыныс келісім-шарты, оны жасасу және ресімдеу Қазақстан
          Республикасының қолданыстағы заңнамасына сәйкес реттеледі.
        </p>
        <p>
          8.13. Осы Ұсыныс келісім-шартына сәйкес курстарда оқыту кезінде
          пайдаланылған, сондай-ақ Орындаушының сайтында орналастырылған кез
          келген материалдарды немесе ақпаратты (оның ішінде сипаттама
          мәтіндерін, фотосуреттерді, бейнематериалдарды және т.б.) пайдалануға,
          таратуға, көшіруге және/немесе шығарып алуға рұқсат етілмейді. Сайтта
          орналастырылған материалдар Қазақстан Республикасының авторлық құқық
          және сабақтас құқықтар туралы қолданыстағы заңнамасымен қорғалады. Осы
          Ұсыныс-келісім-шарты бойынша барлық дауларды шешу кезінде Қазақстан
          Республикасының қолданыстағы заңнамасы қолданылады.
        </p>

        <p class="text-center font-medium mt-6">
          9. Интеллектуалдық әрекеттің нәтижесі
        </p>
        <p>
          9.1. Онлайн платформада өткезген курстарды/тренингтерді өткізу
          процесінде Орындаушы Тапсырыс берушіге ұсынатын барлық ақпараттық
          материалдар, сондай-ақ Орындаушы курстар/тренингтер кезінде алған фото
          және бейне түсіру нәтижелері зияткерлік (интеллектуалдық) қызметтің
          нәтижесі болып табылады, айрықша авторлық құқық, оның ішінде авторлық
          құқыққа қатысты барлық материалдар Орындаушыға тиесілі.
        </p>
        <p>
          9.2. <b>"{{ $contacts.url }}"</b> Онлайн платформасы арқылы оқытылатын
          курстардың фотосуретін, аудио және/немесе бейнежазбаға түсіру тек
          Орындаушының рұқсатымен ғана жүзеге асыруға болады. Орындаушының
          зияткерлік қызметінің нәтижелерін пайдалану Қазақстан Республикасының
          қолданыстағы заңнамасына сәйкес азаматтық-құқықтық, әкімшілік және
          өзге де жауапкершілікке әкеп соғатын Орындаушының айрықша құқығын бұзу
          болып табылады.
        </p>
        <p>
          9.3. Сондай-ақ, Тапсырыс берушінің Орындаушы
          курстарының/тренингтерінің толық немесе ішінара онлайн трансляциясының
          аудио және бейне материалдарын көшіруге, курстар/тренингтер
          трансляцияларын жазуға, сондай-ақ мұндай курстардың/тренингтердің
          мазмұнын толық немесе ішінара кез келген жолмен және/немесе кез келген
          материалдық тасымалдаушыда көшіру, сондай-ақ осы
          курстардың/тренингтердің мазмұнын Орындаушының жазбаша келісімінсіз
          пайдалану, бұл Орындаушының айрықша құқығын бұзу болып саналады және
          азаматтық-құқықтық жауапкершілікке әкеп соғады, Қазақстан
          Республикасының қолданыстағы заңнамасына сәйкес әкімшілік және өзге де
          жауапкершілігімен қарастырылады.
        </p>

        <p class="text-center font-medium mt-6">10. Дауларды шешу</p>
        <p>
          10.1. Тараптардың бірі Келісім-шартты тиісінше орындамаған жағдайда,
          екінші тарап үшін жағымсыз салдарларға әкеп соққан жағдайда, Қазақстан
          Республикасының қолданыстағы заңнамасына сәйкес жауапкершілік
          туындайды.
        </p>
        <p>
          10.2. Барлық даулар мен келіспеушіліктер Тараптар арасындағы
          келіссөздер арқылы шешіледі. Егер даулар мен келіспеушіліктерді
          келіссөздер арқылы шешу мүмкін болмаса, олар Орындаушының орналасқан
          жері бойынша заңмен қарауға ұсынылады.
        </p>

        <p class="text-center font-medium mt-6">
          11. Ұсыныс келісім-шартының әрекет ету мерзімі, ұзарту, өзгерту, бұзу
        </p>
        <p>
          11.1. Осы Келісім-шарт Тапсырыс беруші осы Ашық ұсынысты қабылдаған
          сәттен бастап күшіне енеді және Тараптар өз міндеттемелерін толық
          орындағанға дейін жарамды.
        </p>
        <p>
          11.2. Орындаушы Ұсыныс шарттарына өзгерістер енгізу құқығын өзіне
          қалдырады. Егер Орындаушы Ұсынысқа өзгерістер енгізсе, мұндай
          өзгерістер Орындаушының веб-сайтында жарияланған сәттен бастап күшіне
          енеді.
        </p>
        <p>
          11.3. Тапсырыс беруші Ұсынысқа түзетулер енгізу Тапсырыс беруші мен
          Орындаушы арасында жасалған және ағымдағы (қолданыстағы)
          Келісім-шартқа осы өзгерістерді енгізуге әкеп соғатынымен келіседі
          және мойындайды, Келісім-шартқа осы түзетулер Ұсыныс келісім-шарты
          күшіне енуімен бір мезгілде күшіне енеді.
        </p>
        <p>
          11.4. Тұтынушыға Қызметтердің материалдарына қол жеткізуді ұсынғаннан
          кейін ақшаны қайтару жүзеге асырылмайды. 11.5-тармақта көзделген
          жағдайларды қоспағанда.
        </p>
        <p>
          11.5. Тапсырыс беруші Орындаушыдан осы Келісім-шарттың 11.6-тармағында
          көзделген тәртіппен Тапсырыс берушіге Қызметтердің материалдарына
          рұқсат берілген сәттен бастап күнтізбелік 3 күн ішінде, Тапсырыс
          беруші екіден көп курс сабағын көрмеген жағдайда төленген ақшалай
          қаражатты қайтаруды талап етуге құқылы. Тапсырыс беруші
          Келісім-шарттың осы тармағында көрсетілген қайтару шарттарын орындаған
          жағдайда Орындаушы 10 күнтізбелік күн ішінде Тапсырыс беруші төлеген
          қаражатты 100% қайтарады.
        </p>
        <p>
          11.6. Тапсырыс беруші Келісім-шарттан бас тартқан және ақшаны
          қайтаруға құқығы болған жағдайда, Орындаушы Тапсырыс берушіге ақшаны
          қайтару туралы өтініш нысанын (бұдан әрі – Өтініш) жібереді. Тапсырыс
          беруші Орындаушыдан Өтінім формасын алған күннен бастап 5 (бес) жұмыс
          күнінен кешіктірмей оны дұрыс толтыруға, қол қоюға және сканерленген
          түрде Орындаушының электрондық мекенжайына жіберуге міндеттелінеді.
        </p>
        <p>
          11.7. «Kaspi Bank» АҚ арқылы Несие/бөліп төлеу жоспары бойынша төлем
          жасалған және Тапсырыс беруші Шарттан бас тартқан жағдайда Орындаушы
          Тапсырыс берушіге тек өзінің Сыйақысын қайтарады және Серіктес Банкпен
          шарт жасасу кезінде Орындаушы көтерген пайыздарды/шығындарды өтемейді.
        </p>
        <p>
          11.8. Тапсырыс берушіге курс материалдарына қол жеткізуге рұқсат
          етілгенде, Тапсырыс беруші тапсырмаларды орындағанда және таңдалған
          тарифке сәйкес педагогикалық қолдау алған жағдайда және курсты
          аяқтағанын растайтын электрондық сертификат алғанда, оқуды аяқталды
          деп санайды.
        </p>
        <p>
          11.9. Стандарт пакеттері: заңды және жеке тұлғалар үшін веб-сайтта
          көрсетілген.
        </p>

        <p class="text-center font-medium mt-6">12. Құпиялылық</p>
        <p>
          12.1 Тараптар өзара келісімсіз үшінші тұлғаларға бермеуге немесе
          келісім шарттарында көзделмеген мақсатта, ұйымдық, технологиялық,
          коммерциялық, қаржылық және басқа да Тараптар үшін коммерциялық
          құпияны құрайтын ақпаратты пайдаланбауға міндеттелінеді, бұл жағдайда:
        </p>

        <ol class="pl-10 mb-4">
          <li>
            мұндай ақпарат үшінші тұлғаларға белгісіз болғандықтан нақты немесе
            әлеуетті коммерциялық құндылыққа ие;
          </li>
          <li>мұндай ақпаратқа заңды тұрғыда еркін қол жеткізудің болмауы;</li>
          <li>
            мұндай ақпараттың иесі оның құпиялылығын қамтамасыз ету үшін тиісті
            шараларды қабылдайды.
          </li>
        </ol>

        <p>
          12.2. Құпиялық ақпаратты қорғау мерзімін Тараптар Ұсыныс
          келісім-шартының қолданылу мерзімі аяқталған күннен бастап кемінде бір
          жылға белгілейді.
        </p>

        <p class="text-center font-medium mt-6">13. Басқа да талаптар</p>
        <p>
          13.1. Осы Келісім-шарт Тараптар барлық міндеттемелерді орындамайынша
          жарамды. Барлық қосымшалар осы Келісім-шарттың ажырамас бөлігі болып
          табылады.
        </p>
        <p>
          13.2. Ұсыныс келісім-шарты – бұл Орындаушы мен Тапсырыс беруші
          арасындағы толық келісім. Орындаушы Ұсыныста көрсетілгендерді
          қоспағанда, Ұсыныс мәнене қатысты қандай да бір шарттар мен
          міндеттемелерді қабылдамайды, егер мұндай шарттар немесе міндеттемелер
          жазбаша түрде ресімделмесе және Орындаушы және Тапсырыс беруші қол
          қоймаса. Ұсыныс келісім-шартына Қосымшалардың немесе Қосымша
          келісімдердің кез келген талаптары Ұсыныс талаптарына қайшы келсе,
          Оферта ережелері басым болады.
        </p>
        <p>
          13.3. Тапсырыс беруші Ұсыныс келісім-шартын өз еркімен жасайды,
          сонымен қатар Тапсырыс беруші:
        </p>
        <ul class="pl-10 mb-4">
          <li>Ұсыныс шарттарымен танысты;</li>
          <li>Ұсыныс мәні мен Ұсыныс келісім-шартын толық түсінеді;</li>
          <li>
            Ұсыныс келісім-шарты жасау мен орындауға қатысты өз әрекеттерінің
            мәні мен салдарын толық түсінеді.
          </li>
        </ul>

        <p>
          13.4. Тапсырыс беруші Ұсыныс Келісім-шартын жасау үшін қажетті барлық
          құқықтар мен өкілеттіктерге ие.
        </p>
        <p>
          13.5. Егер Ұсыныстың кез келген шарттары жарамсыз немесе заңсыз деп
          танылса немесе Қазақстан Республикасының қолданыстағы заңнамасына
          сәйкес күшіне енбесе, ол Ұсыныстан алынып тасталады және бастапқы
          Ұсынычта қамтылған ниеттерге барынша сәйкес келетін жаңа ережемен
          ауыстырылады. Ал Ұсыныстың (Ұсыныс Келісім-шартын) қалған ережелері
          өзгермейді және күшінде қалады.
        </p>
        <p>
          13.6. Осы Шартта көрсетілмеген барлық басқа мәселелерде Тараптар
          Қазақстан Республикасының қолданыстағы заңнамасын басшылыққа алады.
        </p>

        <p>
          Тапсырыс беруші осы Келісім-шарттың барлық шарттары оған түсінікті
          екенін растайды және ол оларды сөзсіз және толық көлемде қабылдайды.
          Шағымдар немесе тармақтармен келіспеген жағдайда, Тапсырыс беруші
          Орындаушыға
          <b class="text-corp"
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >
          электрондық поштасы арқылы қалаған жеке шарттар туралы жазбаша
          хабарлауы керек.
        </p>

        <p class="text-center font-medium mt-6">
          14. Орындаушының реквизиттері
        </p>

        <p>
          Заңды тұлға:
          <b>{{ $contacts.legal_name[localeProperties.code] }}</b>
        </p>
        <p>
          БСН: <b>{{ $contacts.bin }}</b>
        </p>

        <p>
          Заңды мекенжайы:
          <b>{{ $contacts.legal_address[localeProperties.code] }}</b>
        </p>

        <p>
          Нақты мекенжайы:
          <b>{{ $contacts.fact_address[localeProperties.code] }}</b>
        </p>

        <p>
          Банк реквизиттері:
          <b>{{ $contacts.bank.name[localeProperties.code] }}</b>
        </p>

        <p>
          БСК: <b>{{ $contacts.bank.bik }}</b>
        </p>

        <p>
          ЖСК: <b>{{ $contacts.bank.iik }}</b>
        </p>

        <p>
          Директор: <b>{{ $contacts.founder }}</b>
        </p>
      </div>
    </div>
  </div>
</template>
<script setup>
const { t, localeProperties } = useI18n();
useHead({
  title: t("pages.the-offer-agreement.title"),
  meta: [{ name: "description", content: "My amazing site." }],
});
</script>
