<template>
  <div class="custom-grid">
    <div class="col-span-12 md:col-span-4">
      <stickyBox :offsetTop="100">
        <div class="card p-4">
          <h4 class="mb-2">{{ $t("content") }}</h4>

          <ul class="list-none px-0">
            <li v-for="item in headings" :key="item.id">
              <button
                class="text-left"
                @click="scrollTo(item.id, headerOffset)"
              >
                {{ item.text }}
              </button>
            </li>
          </ul>
        </div>
      </stickyBox>
    </div>
    <div class="col-span-12 md:col-span-8 text-justify hyphens-auto">
      <h2>{{ $t("pages.privacy-policy.title") }}</h2>

      <div v-if="localeProperties.code === 'ru'">
        <p class="title text-center font-bold mt-6">1. Определения</p>
        <p>
          Интернет проект
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          >
          (далее - URL, «мы») серьезно относится к вопросу конфиденциальности
          информации своих клиентов и посетителей сайта
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          >
          (далее - «вы», «посетители сайта»). Персонифицированной мы называем
          информацию, содержащую персональные данные (например: ФИО, логин или
          название компании) посетителя сайта, а также информацию о действиях,
          совершаемых вами на сайте URL. (например: заказ посетителя сайта с его
          контактной информацией). Анонимными мы называем данные, которые
          невозможно однозначно идентифицировать с конкретным посетителем сайта
          (например: статистика посещаемости сайта).
        </p>

        <p class="title text-center font-bold mt-6">
          2. Использование информации
        </p>

        <p>
          Мы используем персонифицированную информацию конкретного посетителя
          сайта исключительно для обеспечения ему качественного оказания услуг и
          их учета. Мы не раскрываем персонифицированных данных одних
          посетителей сайта URL другим посетителям сайта. Мы никогда не
          публикуем персонифицированную информацию в открытом доступе и не
          передаем ее третьим лицам. Исключением являются лишь ситуации, когда
          предоставление такой информации уполномоченным государственным органам
          предписано действующим законодательством Республики Казахстан. Мы
          публикуем и распространяем только отчеты, построенные на основании
          собранных анонимных данных. При этом отчеты не содержат информацию, по
          которой было бы возможным идентифицировать персонифицированные данные
          пользователей услуг. Мы также используем анонимные данные для
          внутреннего анализа, целью которого является развитие продуктов и
          услуг URL
        </p>

        <p class="title text-center font-bold mt-6">3. Ссылки</p>

        <p>
          Сайт
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          >
          может содержать ссылки на другие сайты, не имеющие отношения к нашей
          компании и принадлежащие третьим лицам. Мы не несем ответственности за
          точность, полноту и достоверность сведений, размещенных на сайтах
          третьих лиц, и не берем на себя никаких обязательств по сохранению
          конфиденциальности информации, оставленной вами на таких сайтах.
        </p>

        <p class="title text-center font-bold mt-6">
          4. Ограничение ответственности
        </p>

        <p>
          Мы делаем все возможное для соблюдения настоящей политики
          конфиденциальности, однако, мы не можем гарантировать сохранность
          информации в случае воздействия факторов, находящихся вне нашего
          влияния, результатом действия которых станет раскрытие информации.
          Сайт <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          > и вся размещенная на нем информация представлены по принципу "как
          есть" без каких-либо гарантий. Мы не несем ответственности за
          неблагоприятные последствия, а также за любые убытки, причиненные
          вследствие ограничения доступа к сайту URL или вследствие посещения
          сайта и использования размещенной на нем информации.
        </p>

        <p class="title text-center font-bold mt-6">5. Контакты</p>

        <p>
          По вопросам, касающимся настоящей политики, просьба обращаться по
          адресу
          <b
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >
        </p>
      </div>

      <div v-else-if="localeProperties.code === 'kk'">
        <p class="title text-center font-bold mt-6">1. Анықтамалар</p>

        <p>
          Интернет жобасы
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          >
          (бұдан әрі – URL, «біз») өз клиенттері мен сайтқа келушілердің (бұдан
          әрі – «сіз», «сайт келушілері») ақпараттарының құпиялығына үлкен мән
          береді. Жеке деректер деп біз сайт келушісінің жеке басын анықтайтын
          ақпаратты (мысалы: ТАӘ, логин немесе компания атауы), сондай-ақ URL
          сайтында сіз жасаған әрекеттер туралы ақпаратты (мысалы: сіздің
          байланыс ақпаратыңыз көрсетілген тапсырыс) атаймыз. Анонимді ақпарат
          деп біз нақты сайт келушісін тікелей анықтай алмайтын деректерді
          (мысалы: сайтқа келушілер статистикасы) атаймыз.
        </p>

        <p class="title text-center font-bold mt-6">2. Ақпаратты пайдалану</p>

        <p>
          Біз сайт келушісінің жеке ақпаратын тек сапалы қызмет көрсету және оны
          есепке алу мақсатында пайдаланамыз. Біз URL сайтының бір келушісінің
          жеке деректерін басқа келушілерге ашпаймыз. Біз жеке деректерді
          ешқашан ашық түрде жарияламаймыз және үшінші тұлғаларға бермейміз.
          Ерекше жағдай — Қазақстан Республикасының қолданыстағы заңнамасына
          сәйкес уәкілетті мемлекеттік органдарға мұндай ақпаратты беру міндетті
          болғанда ғана.Біз тек жиналған анонимді деректер негізінде құрылған
          есептерді жариялаймыз және таратамыз. Бұл есептерде пайдаланушылардың
          жеке деректерін анықтауға мүмкіндік беретін ешқандай ақпарат
          болмайды.Сондай-ақ, біз анонимді деректерді URL өнімдері мен
          қызметтерін дамыту мақсатындағы ішкі талдау үшін пайдаланамыз.
        </p>
        <p class="title text-center font-bold mt-6">3. Сілтемелер</p>

        <p>
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          > сайты үшінші тұлғаларға тиесілі және біздің компанияға қатысы жоқ
          басқа сайттарға сілтемелерді қамтуы мүмкін. Біз үшінші тұлғалардың
          сайттарында орналастырылған мәліметтердің нақтылығы, толықтығы және
          шынайылығы үшін жауап бермейміз және сіздің бұл сайттарда қалдырған
          ақпаратыңыздың құпиялығын сақтау жөнінде ешқандай міндеттемелер
          алмаймыз.
        </p>

        <p class="title text-center font-bold mt-6">
          4. Жауапкершіліктің шектелуі
        </p>

        <p>
          Біз осы құпиялылық саясатын сақтау үшін бар күшімізді саламыз, алайда
          біздің бақылауымыздан тыс факторлар әсер еткен жағдайда ақпараттың
          жария болмауына және оның қорғалатынына кепілдік бере алмаймыз.
          <b
            ><nuxt-link to="/">https://{{ $contacts.url }}</nuxt-link></b
          > сайты және ондағы барлық ақпарат «қандай күйде болса, сол күйде»
          қағидасымен ешқандай кепілдіксіз ұсынылады. Біз сайтқа URL
          қолжетімділіктің шектеұлуіне немесе сайтқа кіру және ондағы ақпаратты
          пайдалану нәтижесінде сізге келтірілген кез келген жағымсыз салдарлар
          мен залалдар үшін жауап бермейміз.
        </p>

        <p class="title text-center font-bold mt-6">5. Байланыс</p>

        <p>
          Осы құпиялылық саясатына қатысты сұрақтар бойынша келесі мекенжайға
          хабарласуыңызды сұраймыз:
          <b
            ><a :href="'mailto:' + $contacts.email">{{ $contacts.email }}</a></b
          >.
        </p>
      </div>
    </div>
  </div>
</template>
<script setup>
import stickyBox from "../ui/stickyBox.vue";
import { scrollTo } from "../../utils/scrollTo";
const { t, localeProperties } = useI18n();
const headings = ref([]);
const headerOffset = 110;

onMounted(() => {
  const elements = document.querySelectorAll("p.title");

  headings.value = Array.from(elements).map((el, index) => {
    const id = `title-${index}`;
    el.setAttribute("id", id);
    return {
      id,
      text: el.textContent.trim(),
    };
  });
});
</script>